// 操作类型 1000 账户相关操作  2000  关键词相关操作
const { MKT_OPERATE_LOG, AUTOMATIC_RULE, EXPIRE_SETTING, ACCOUNT_TABLE, TABLE_CONSULTANT, BLOGGER_TABLE } = require("../../config/setting")
const moment = require("moment")
const { log_storage } = require("../../config/index");
const { operate } = require("../../utils/logs/logstash");
const knex = require("../../db/knexManager").knexProxy;
const LOG_MAPPER = {
    //0~1000：账户管理
    101: "新增用户",
    102: "编辑用户",
    103: "删除用户",
    104: "修改密码",
    105: "修改用户头像",

    //个人中心用户自主修改
    106: "用户修改个人资料",
    107: "用户修改密码",
    108: "用户绑定邀请码",
    109: "登录绑定三方平台",
    110: "用户主动注销",
    111: "用户实名认证",

    //用户发起预支付订单
    120: "用户发起预支付订单",
    121: "用户发起订单结果查询",
    122: "下发会员权益",
    123: "回收会员权益",
    124: "使用会员权益",
    125: "下发权益更新订单返利",
    126: "财务复核订单",
    127: "回收用户权益更新账户表",
    128: "回收用户权益更新记录表",
    129: "写入会员基础返利数据",
    130: "BUG数据恢复",

    201: "新增角色",
    202: "编辑角色",
    203: "删除角色",

    301: "新增部门",
    302: "编辑部门",
    303: "删除部门",

    401: "新增机构",
    402: "编辑机构",
    403: "删除机构",

    501: "新增菜单",
    502: "编辑菜单",
    503: "删除菜单",

    //1001~1100：投顾管理
    1001: "新增投顾",
    1002: "更新信息",
    1003: "修改密码",
    1004: "删除投顾",
    1005: "批量导入投顾",
    1006: "批量修改直属上级",
    1007: "修改状态",
    1008: "更新分享链接",

    //1101~1200：博主管理
    1101: "新增博主",
    1102: "编辑博主",
    1103: "删除博主",
    1104: "博主自主注册",
    1105: "博主转投顾",

    //1301~1400：博主平台
    1301: "新增博主平台",
    1302: "修改博主平台",
    1303: "博主平台账号审核",
    1311: "博主平台修改收藏",
    1312: "博主平台修改加购",
    1313: "博主平台新增收藏",
    1314: "博主平台新增加购",
    1315: "新增授权账号",
    1316: "授权账号触发换绑确认",
    //1401 - 1450 会员码管理
    1401: "新增会员码",
    1402: "更新会员码",

    2001: "新增关键词",
    2002: "更新关键词信息",
    2004: "更新关键词审核状态",
    2005: "导入审核结果",
    2006: "删除关键词",
    // 2007: "启用关键词",

    2051: "关键词分配",
    2052: "关键词配置状态",
    2053: "关键词反馈",
    2054: "新增通用词规则",
    2055: "修改通用词规则",
    2056: "触发审核通过未分配",
    2057: "触发分配成功未发布",
    2058: "触发过期未重新发布",
    2059: "关键词发布反馈导入",
    2060: "修改关键词发布反馈",
    2061: "关键词发布过期",
    2062: "作品发布期次变更",
    2063: "作品导入期次变更",

    //2101~2200：发布期次
    2101: "发布期次关键词状态",
    2102: "发布期次送审标记",
    2103: "发布期次作品状态",
    2104: "发布期次作品审核状态",
    2105: "发布期次作品审核反馈导入",
    2106: "小店作品集修改作品",
    2107: "发布期次作品审核反馈导入改变期次",

    //3001~3010: 工具-系统配置-平台管理
    3001: "新增平台",
    3002: "编辑平台",
    3003: "删除平台",

    //3011~3020 工具-系统配置-品类管理
    3011: "新增品类",
    3012: "编辑品类",
    3013: "删除品类",

    3014: "新增作品类型",
    3015: "编辑",
    3016: "删除",

    //3021~3030 工具-系统配置-作品周期
    3021: "新增规则",
    3022: "编辑规则",
    3023: "删除规则",

    //3031~3040 工具-用户反馈
    3031: "新增用户反馈",
    3032: "编辑用户反馈",

    //3201~3300 工具-审批流管理
    3201: "新增审批流",
    3202: "编辑审批流",
    3203: "删除审批流",

    //3301~3400 工具-禁投书名/业务品类
    3301: "新增禁投书名",
    3302: "编辑禁投书名",
    3303: "删除禁投书名",
    3311: "新增业务品类",
    3312: "编辑业务品类",
    3313: "删除业务品类",
    3314: "书籍上下架",

    //3401~3420 工具-银行信息
    3401: "新增银行信息",
    3402: "编辑银行信息",
    3403: "修改银行优先级",
    3404: "修改银行标签",

    //3421~3450 工具-关键词内容
    3421: "新增关键词内容信息",
    3422: "编辑关键词内容信息",
    3423: "修改关键词内容优先级",

    //3451~3460 工具-修改最高收益
    3451: "新增关键词内容信息",

    // 3470~3480 工具-物料大小配置
    3471: "新增素材配置规则",
    3472: "编辑素材配置规则",
    3473: "删除素材配置规则",

    //4001~4200 广告主商务报价
    4001: '新增广告主商务报价',
    4002: "编辑广告主商务报价",
    4003: "删除广告主商务报价",
    4010: '提交审核商务报价',
    4011: '人员审核商务报价',
    //广告主管理
    4101: '新增推广项目',
    4102: "编辑推广项目",
    4103: "删除推广项目",
    4104: '项目上线/下线',
    4105: '修改项目小程序推广计划结算字段',

    4151: '新增推广类目',
    4152: "编辑推广类目",
    4153: "删除推广类目",

    4111: "新增公司主体",
    4112: "编辑公司主体",
    4113: "删除公司主体",

    4121: "新增结算方式",
    4122: "编辑结算方式",
    4123: "删除结算方式",

    4131: "新增结算参数",
    4132: "编辑结算参数",
    4133: "删除结算参数",

    4141: "新增推广目的",
    4142: "编辑推广目的",
    4143: "删除推广目的",

    4150: "修改任务素材详情",
    4151: "新增推广任务",
    4152: "编辑推广任务",
    4153: "删除推广任务",
    4154: "新增任务批量添加标题",
    4155: "新增任务批量添加置顶文案",
    4156: "任务作品发布回填",
    4157: "任务作品导入审核",
    4158: "任务作品状态",
    4159: "任务作品送审",
    4160: "任务作品发布回填修改",

    4161: "用户领取素材",
    4162: "用户放弃任务",
    4163: "用户下载素材",
    4164: "领取素材自动过期",

    //4201~4300 政策报备
    4201: '新增政策报备',
    4202: '政策报备更新',
    4203: '政策批量操作',
    4204: '政策终止',
    4210: '提交审核政策报备',
    4211: '人员审核政策报备',
    4212: '博主类型切换终止报价',
    4213: '新增博主系统自动报价',
    4214: '博主切换负责人终止报价',
    4215: '博主切换负责人自动报价',
    4220: '投顾政策通过博主自动报价',

    // 4301~ 4400
    4302: '删除客户线索',

    // 4401~ 4450
    4401: '数据导入日志',
    4402: '待结算数据新增',
    4403: '数据导入删除',
    4404: '修改结算量',
    4405: '刷新报价',
    4406: '刷新客户报价',

    // 4451~ 4500
    4451: '小程序数据导入日志',
    4452: '小程序待结算数据新增',
    4453: '小程序数据导入删除',
    4454: '小程序修改结算量',
    4455: '小程序刷新报价',
    4456: '小程序刷新客户报价',

    // 4501 ~4550
    4501: "结算提交审核",
    4502: "结算人员审核",
    4503: "结算完成写入推广提现收益表",
    4504: "结算完成写入佣金提现收益表",

    // 4551 ~4580
    4551: "小程序结算提交审核",
    4552: "小程序结算人员审核",
    4553: "小程序结算完成写入推广提现收益表",
    4554: "小程序结算完成写入佣金提现收益表",

    // 4601~ 4650
    4601: "删除导入日志",
    4602: "一键删除导入失败",
    4603: "一键删除重复导入",
    //4651 ~ 4670 小程序结算
    4651: "新增/修改核销规则",
    4652: "新增/修改广告规则",

    //5000~5100 koc付款-付款申请
    5001: "新增收款申请",
    5002: "新增收款主体",
    5003: "修改收款申请",

    //5101~5200 koc付款-付款审批中
    5101: "付款提交审核",
    5102: "付款人员审核",
    5103: "付款回单",
    5104: "删除回单",
    5105: '用户提现申请',
    5106: '归档',
    5107: '编辑付款',
    5108: '重新提交付款申请',
    5109: '退款',
    5150: "大熊更新订单状态",
    5110: "爱才创建任务",
    5111: "爱才创建发放明细",
    5112: "爱才确认发放任务",

    //5201~5300 koc付款-已审批
    5201: "付款归档",
    5202: "修改打款银行卡",

    //5301~5400 系统批量导入修改发布日期
    5301: "系统批量导入修改发布日期（关键词）",
    5302: "系统批量导入修改发布日期（作品）",
    5303: "系统批量导入修改审核日期（作品）",

    //5401~5450 消息模块
    5401: "新增消息",
    5402: "删除主消息",
    5403: "删除单人消息",
    5404: "已读单人消息",
    5405: "编辑消息发布状态",

    //5451~5500 物料模块
    5451: "新增素材",
    5452: "删除素材",
    5453: "编辑素材",

    //5501~5600 标题库、文案库
    5501: "新增标题",
    5502: "修改标题",
    5503: "导入标题",
    5504: "新增文案",
    5505: "修改文案",
    5506: "导入文案",

    //6001~6030 会员卡
    6001: "新增",
    6002: "修改",
    6003: "删除",
    6004: '提交审核政策报备',
    6005: '人员审核政策报备',
    6006: "终止",

    //6031~6040 会员卡等级
    6031: "新增",
    6032: "修改",
    6033: "删除",

    //6041~6050 会员卡类型
    6041: "新增",
    6042: "修改",
    6043: "删除",

    // 6051~6070 业务类型
    6051: "新增业务类型",
    6052: "删除业务类型",

    // 6071~6100 项目产品


    //6101~6120 佣金政策
    6101: "新增",
    6102: "修改",
    6103: "删除",

    //6121~6140 佣金类型
    6121: "新增",
    6122: "修改",
    6123: "删除",

    //6141~6180 会员卡
    6141: "新增",
    6142: "修改",
    6143: "删除",
    6144: '提交审核政策报备',
    6145: '人员审核政策报备',

    //6181~6200：发布期次
    6181: "导出送审",
    6182: "导入审核结果",
    6183: "发布作品",
    6184: "修改作品",
    6185: "删除作品",

    //6201~6220：目录配置
    6201: "新增",
    6202: "修改",
    6203: "删除",

    // 6221 - 6230 资产-视频
    6221: '上传视频',
    6222: '编辑视频',
    6223: '批量发布',
    6224: '更新状态',
    6225: '视频领取',
    6226: '视频下载',

    // 6231~6240 资产课程
    6231: "上传课程",
    6232: "编辑课程",
    6233: "批量修改状态",
    6236: "新增合集",

    // 6241~6250 推广-关键词-内容
    6241: "新增内容",
    6242: "新增禁投",
    6243: "编辑内容",
    6244: "审核内容",

    // 6251~6260 关键词-项目配置
    6251: "新增项目配置",
    6252: "编辑项目配置",
    6253: "新增项目字典",

    // 6261~6270 banner广告
    6261: "新增",
    6262: "修改",

    // 6271 ~ 6280 素材
    6271: '上传素材',
    6272: '编辑素材',
    6273: '批量发布',
    6274: '更新状态',
    6275: '下载素材',

    // 6281~6330 小程序推广结算
    6281: "核销状态",
    6282: "订单归档",
    6291: "提交结算",
    6292: "结算审核",
    6293: "政策刷新",

    // 6331 ~6350
    6331: "会员佣金提交审核写入聚合表",
    6332: "会员佣金结算人员审核",
    6333: "会员佣金写入佣金提现表",

    // 6351~6360
    6351: "变现佣金提交",
    6352: "变现佣金审核",

    //6401~6450 版本管理
    6401: "版本新增",
    6402: "版本编辑",
    6403: "版本删除",

    //6451~6470 佣金政策
    6451: "新增",
    6452: "修改",
    6453: "删除",
    6454: "发送",
    6455: "撤回",

    //6471~6500 种子会员
    6471: "新增",
    6472: "修改",
    6473: "删除",
    6474: "审核",
    6475: "导入数据",
    6476: "导入审核",

    //6501~6550 渠道管理
    6501: "渠道新增",
    6502: "渠道编辑",
    6503: "渠道删除",
    6504: "渠道密钥",
    6505: "渠道添加二维码",

    //6551~6600 渠道管理
    6551: "首页变现任务新增",
    6552: "修改排序",

    //6601~6630 uid审核
    6601: "uid审核",
    6602: "uid导入审核",
    6603: "uid修改状态",

    //6651~6680 奖励活动
    6651: '新增',
    6652: "修改",
    6653: "批量操作",
    6654: '审核',

    //6681~6700 奖励
    6681: '新增',
    6682: "修改",
    6683: "批量操作",
    6684: '审核',
    6685: '奖励写入提现表',
    6686: '导入新增',

    //6701~6750 星图推广
    6701: '星图推广审核',
    6702: 'MCN审核通过参与星图推广',
    6703: '导入修改MCN分佣比例',
    6704: '编辑MCN任务',
    6705: '导入修改MCN参与人数、收益',
    6706: '导入下架MCN任务',

    //7001~7050 多来看点
    7001: '多来看点订单更新',
    7002: '多来看点用户新增合集',
    7003: '多来看点用户视频提交审核',
    7004: '多来看点用户上下架视频',
    7005: '多来看点用户编辑视频',
    7006: '多来看点用户删除视频',
    7007: '多来看点用户更新信息',
    7008: '多来看点用户上传视频',
    7009: '多来看点视频复审',
    7010: '多来看点分发授权',
    7011: '多来看点操作分发授权',
    // 6702: 'MCN审核通过参与星图推广',
    // 6703: '导入修改MCN分佣比例',

    // 7051~ 8000
    7051: '数据导入日志',
    7052: '待结算数据新增',
    7053: '数据导入删除',
    7054: '数据审核',
    7055: '写入返利表',

    // 8001~ 8030 版权证明
    8001: '新增',
    8002: '编辑',
    8003: '审核',
    8004: '修改',

    // 8031~ 8050 版权内容
    8031: '新增',
    8032: '编辑',
    8033: '审核',
    8034: '修改',

    // 8051~8100 创作者管理
    8051: '新增创作者',
    8052: '编辑创作者',
    8053: '原创企业认证',

    //8101~8130 原创政策
    8101: "新增",
    8102: "修改",
    8103: "删除",
    8104: '审核',
    8105: "终止",

    // 8131~ 8150 授权承制
    8131: '新增',
    8132: '修改',

    // 8151 ~ 8160  剧集收益
    8151: "财务复核订单",

    //8180~8200 看点结算政策
    8181: "新增",
    8182: "修改",
    8183: "删除",
    8184: '审核',
    8185: "终止",

    //#region 移动端
    20000: "小程序推广计划迁移",

    // 20001~20010短剧变现 -- 计划
    20001: "计划新增",
    20002: "计划状态修改",


    //20101 工具记录
    20101: "用户删除工具记录",


    //#endregion
}
function getLogData(relation_id, operation_type = 0, new_data = {}, userInfo = {}, old_data = {}) {
    let { id, oem_id } = userInfo
    let { before_data, operation_data } = margeData(old_data, new_data)
    return {
        create_user_id: id,
        update_user_id: id,
        operation_type,
        relation_id,
        oem_id: oem_id || 1,
        before_data: JSON.stringify(before_data),
        operation_data: JSON.stringify(operation_data),
        create_time: moment().format('YYYY-MM-DD HH:mm:ss')
    }
}
function margeData(before_data = {}, operation_data = {}) {
    // console.log(before_data)
    if (!before_data) return { before_data: null, operation_data: { ...operation_data } }
    let change = {
        before_data: {},
        operation_data: {}
    }
    let all_data = { ...before_data, ...operation_data }
    Object.keys(all_data).forEach(key => {
        if (before_data[key] != operation_data[key]) { //新老数据不一致时，写入新老数据
            if (Object.hasOwnProperty.call(before_data, key) && Object.hasOwnProperty.call(operation_data, key)) change.before_data[key] = before_data[key]
            if (Object.hasOwnProperty.call(operation_data, key)) change.operation_data[key] = operation_data[key]
        }
    })
    return change
}
async function insertLog(trx = knex, data = []) {
    let logs = []
    if (data.constructor === Array && data.length) logs = data
    if (data.constructor === Object && data.relation_id) logs = [data]
    switch (log_storage) {
        case 'MYSQL':
            await trx(MKT_OPERATE_LOG).insert(logs)
            break;
        case 'ELK':
            for (let index = 0; index < logs.length; index++) {
                const element = logs[index];
                operate(element.relation_id, element)
            }
            break;
        case 'BOTH':
            await trx(MKT_OPERATE_LOG).insert(logs)
            for (let index = 0; index < logs.length; index++) {
                const element = logs[index];
                operate(element.relation_id, element)
            }
            break;
        default:
            break;
    }
}

async function getExpireDay(advertiser_type, oem_id) {
    let current_date = moment().format("YYYY-MM-DD")
    let expire_rules = await knex(EXPIRE_SETTING).select('advertiser_type', 'days').where({ status: 1, oem_id })
        .where(builder => {
            builder.where('start_date', '<=', current_date).where(bu => {
                bu.where('end_date', '>=', current_date).orWhereNull('end_date')
            })
        })
    let expire_day_mapper = {}
    expire_rules.forEach(i => {
        expire_day_mapper[i.advertiser_type] = Number(i.days) - 1
    })
    if (advertiser_type) return expire_day_mapper[advertiser_type] || null
    return expire_day_mapper
}
async function getVerifyExpireDay(advertiser_type, oem_id) {
    let expire_rules = await knex(AUTOMATIC_RULE)
        .select('advertiser_id as advertiser_type', 'rules')
        .where({ status: 1, oem_id, operation_object: 4 })
    let expire_day_mapper = {}
    expire_rules.forEach(i => {
        let date_info = JSON.parse(i.rules)[0]
        expire_day_mapper[i.advertiser_type] = Number(date_info.days) - 1
    })
    if (advertiser_type) return expire_day_mapper[advertiser_type] || null
    return expire_day_mapper
}
// getVerifyExpireDay(null, 1).then(data => { console.log(data); })
async function getAccountType(account_id, trx = knex) {
    let account_data = (await trx.select('acc.id')
        .select(knex.raw(`IF(blo.account_id IS NOT NULL,1,IF(cst.account_id IS NOT NULL,2,3)) as account_type`))
        .from(`${ACCOUNT_TABLE} as acc`)
        .leftJoin(`${TABLE_CONSULTANT} as cst`, 'cst.account_id', 'acc.id')
        .leftJoin(`${BLOGGER_TABLE} as blo`, 'blo.account_id', 'acc.id')
        .where({ "acc.id": account_id }))[0]
    if (!account_data) return Promise.reject('当前账户不存在！')
    return account_data.account_type
}
module.exports = {
    getLogData,
    insertLog,
    LOG_MAPPER,
    getExpireDay,
    getVerifyExpireDay,
    getAccountType
}