import { AUTH_RIGHT_MAPPER } from './authRight';

const AUTH_MAPPER = {
  // v-auth="'SPSC-MAIN-INTB'"
  //命名规则 菜单名-tab页名-按钮 注意，该值为唯一值
  'SPSC-MAIN-INTB': [33, 12], //数组内存放可以看见的角色role_id
  //举例如果在table表格中，请加入INTB关键字 SELF 表示本身，即下单人
  'SPSC-JBQR-TG-INTB': [63, 64, 65, 1, 11, 32, 'SELF'],
  'SPSC-JBQR-JJ-INTB': [63, 64, 65, 1, 11, 32, 'SELF'],
  'SPSC-DDGL-BD': [82, 91, 32, 1, 11, 21], //视频生产-订单管理-编导按钮
  'SPSC-DDGL-BD-INTB': [82, 91, 32, 1, 2, 11], //视频生产-订单管理-编导按钮-table
  'SPSC-PJDDC-ZPCK-INTB': [85, 91, 32, 1, 2, 11], //视频生产-拍剪订单池-指派查看按钮-table
  'SPSC-PJDDC-ZP': [85, 91, 32, 1, 2, 11], //视频生产-拍剪订单池-指派按钮
  'SPSC-DDGL-QD-INTB': [20, 81, 32, 1, 11, 2, 'SELF'], //视频生产-抢单池-抢单按钮-table
  'SPSC-PJXQ-XJ': [32, 1, 11, 2, 20, 81, 82], //拍剪需求-新建
  'SPSC-PJXQ-XJ-INTB': [32, 1, 11, 2, 20, 81, 82], //拍剪需求-新建-table
  'SPSC-PJXQ-CK-INTB': [32, 1, 11, 2, 20, 81, 82, 91, 63, 64, 65, 83, 84, 85], //拍剪需求-查看
  'DDPJ-TFMT-XJBJ': [32, 1, 11, 2, 53, 69], //系统配置-订单管理-新建 /素材规范-新建
  'DDPJ-TFMT-XJBJ-INTB': [32, 1, 11, 2, 53, 69], //系统配置-订单管理-编辑-表格 /素材规范-编辑删除
  'DDPJ-TFMT-SCBJ-INTB': [32, 1, 11, 2, 53], //系统配置-订单管理-投放媒体-删除
  'DDPJ-SCGF-CK-INTB': [32, 1, 11, 2, 53, 69, 63, 64, 65], //系统配置-订单管理-素材规范-查看
  'DDPJ-SPNRLX-XJ': [32, 1, 11, 2, 91, 67, 82], //系统配置-订单管理-视频内容类型-新建
  'DDPJ-SPNRLX-BJ-INTB': [32, 1, 11, 2, 'SELF'], //系统配置-订单管理-视频内容类型-编辑
  'DDPJ-SPNRLX-SC-INTB': [32, 1, 11, 2], //系统配置-订单管理-视频内容类型-删除
  'SPSC-JBQR-CK-INTB': [32, 1, 11, 91, 82, 81, 20, 63, 64, 65, 66, 44], //脚本确认查看
  'SPSC-JBQR-PL': [32, 63, 64, 65, 1, 11, 66], //脚本确认-批量
  //工作台-资源确认
  'SPSC-ZYQR-SH-INTB': [32, 1, 11, 88, 86, 87, 89], //资源确认审核
  'SPSC-ZYQR-SH': [32, 1, 11, 88, 86, 87, 89], //资源确认审核 -批量
  'SPSC-ZYQR-CK-INTB': [32, 1, 11, 91, 88, 86, 87, 89], //资源确认查看脚本

  //创意订单-视频订单
  'CYDD-SPDD-FZ-INTB': [32, 1, 11, 65, 64, 63, 43, 44, 45], //复制视频订单
  'CYDD-SPDD-XJ': [32, 1, 11, 65, 64, 63, 43, 44, 45, 66], //新建视频订单
  'CYDD-SPDD-PL': [32, 1, 11, 91, 67, 63, 65, 64, 43, 44, 45, 66], //视频订单批量/导出
  'CYDD-SPDD-FJ-INTB': [32, 1, 11, 91, 67, 63, 65, 64, 43, 44, 45, 66], //视频订单附件
  'CYDD-SPDD-BJ-INTB': [65, 64, 63, 43, 44, 45, 'SELF'],
  //工作台-上传脚本
  'SPSC-SCJB-XZ': [32, 1, 11, 82, 81, 20], //下载脚本模板

  'SPSC-PSPQ-SCPQ': [1, 2, 11, 32, 91, 88],
  'SPSC-PSPQ-XZPQ': [1, 2, 11, 32, 91, 82, 81, 20, 85, 84, 83, 88, 86, 87, 89, 90],
  'SPSC-PSPQ-SQQR': [1, 2, 11, 32, 91, 88, 90],
  'SPSC-PSPQ-SQQR-INTB': [1, 2, 11, 32, 91, 88, 90, 'SELF'],
  'SPSC-PSPQ-CKJB-INTB': [
    1,
    2,
    11,
    32,
    91,
    82,
    81,
    20,
    85,
    84,
    83,
    88,
    86,
    87,
    89,
    90,
    63,
    64,
    65,
    'SELF',
  ],

  'CD-CDK-XJCD': [1, 2, 11, 32, 91, 88, 87], //场地-新建
  'CD-CDK-PLDR': [1, 2, 11, 32, 91, 88, 87], //场地-批量
  'CD-CDK-BJ-INTB': [1, 2, 11, 32, 91, 88, 87, 'SELF'], //场地-编辑
  'CD-CDK-SC-INTB': [1, 2, 11, 32, 91, 88, 87, 'SELF'], //场地-删除
  'CD-CDK-XZBJD-INTB': [1, 2, 11, 32, 88, 87, 'SELF'], //场地-新建报价单
  'CD-CDK-CKBJD-INTB': [1, 2, 11, 32, 91, 88, 87, 36, 37, 'SELF'], //场地-查看报价单
  'CD-CDK-ZL-INTB': [1, 2, 11, 32, 91, 88, 87, 'SELF'], //场地-租赁
  'CD-CDK-SCTP-INTB': [1, 2, 11, 32, 91, 88, 87, 'SELF'], //场地-租赁
  'CD-CDK-SCSP-INTB': [1, 2, 11, 32, 91, 88, 87, 'SELF'], //场地-租赁

  'CD-CDBJD-XZBJ': [1, 2, 11, 32, 88, 87], //场地报价单-新建
  'CD-CDBJD-ZL': [1, 2, 11, 32, 88, 87], //场地报价单-租赁
  'CD-CDBJD-SC': [1, 2, 11, 32, 91, 88, 87], //场地报价单-删除

  'DJ-DJ-XZ': [1, 2, 11, 32, 91, 88, 89], //道具-新增
  'DJ-DJ-PLDR': [1, 2, 11, 32, 91, 88, 89], //道具-批量导入
  'DJ-DJ-BJ-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //道具-编辑
  'DJ-DJ-SC-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //道具-删除
  'DJ-DJ-ZL-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //道具-租赁
  'DJ-DJ-CG-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //道具-采购
  'DJ-DJ-ZLJL-INTB': [1, 2, 11, 32, 91, 88, 89, 36, 37, 'SELF'], //道具-租赁记录
  'DJ-DJ-CGJL-INTB': [1, 2, 11, 32, 91, 88, 89, 36, 37, 'SELF'], //道具-采购记录
  'DJ-DJ-CKJL-INTB': [1, 2, 11, 32, 91, 88, 89, 36, 37, 38, 20, 81, 82, 'SELF'], //道具-查看使用记录
  'DJ-DJ-SCTP-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //道具-上传图片

  'FZ-FZ-XZ': [1, 2, 11, 32, 91, 88, 89], //服装-新增
  'FZ-FZ-PLDR': [1, 2, 11, 32, 91, 88, 89], //服装-批量导入
  'FZ-FZ-BJ-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //服装-编辑
  'FZ-FZ-SC-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //服装-删除
  'FZ-FZ-ZL-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //服装-租赁
  'FZ-FZ-CG-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //服装-采购
  'FZ-FZ-ZLJL-INTB': [1, 2, 11, 32, 91, 88, 89, 36, 37, 'SELF'], //服装-租赁记录
  'FZ-FZ-CGJL-INTB': [1, 2, 11, 32, 91, 88, 89, 36, 37, 'SELF'], //服装-采购记录
  'FZ-FZ-CKJL-INTB': [1, 2, 11, 32, 91, 88, 89, 36, 37, 38, 20, 81, 82, 'SELF'], //服装-查看使用记录
  'FZ-FZ-SCTP-INTB': [1, 2, 11, 32, 91, 88, 89, 'SELF'], //服装-上传图片

  'ZYGL-YY-XZYYYK': [1, 2, 11, 32, 91, 88, 86], //资源管理-演员-新增演员shi
  'ZYGL-YY-BJ-INTB': [1, 2, 11, 32, 91, 88, 86], //资源管理-演员-编辑
  'ZYGL-YY-XZBJD-INTB': [1, 2, 11, 32, 88, 86], //资源管理-演员-新增报价单
  'ZYGL-YY-CKBJD-INTB': [1, 2, 11, 32, 91, 88, 86, 36, 38], //资源管理-演员-新增通告
  'ZYGL-YYBJD-XZBJ': [1, 2, 11, 32, 88, 86], //资源管理-演员报价单-新增报价
  'ZYGL-YYTG-SQQR-INTB': [1, 2, 11, 32, 91, 88, 86, 90], //资源管理-演员通告-杀青确认

  'SPJF-JBMC-INTB': [1, 11, 32, 91, 82, 81, 20, 63, 62, 64, 65, 83, 84, 85], // 视频交付-列表-脚本名称
  'SPJF-EXAME-INTB': [1, 11, 32, 91, 63, 64, 65], // 视频交付-单个审核
  'SPJF-EXAME': [1, 11, 32, 91, 63, 64, 65, 66, 44], // 视频交付-批量审核
  'SPJF-UPLOAD-INTB': [1, 11, 32, 85, 84, 83, 62], // 视频交付-上传文件
  'SPJF-WORK-HANDOVER': [1, 11, 32, 85, 84, 83, 62], // 视频交付-工作交接

  // 右侧按钮权限
  ...AUTH_RIGHT_MAPPER,
};

export { AUTH_MAPPER };
