<template>
  <div class="AgreementPrivacy">
    <div class="txtbox">
      <h2>力推联盟隐私政策</h2>
      <br />
      <p>更新日期：【2022】年【3】月【1】日</p>
      <br />
      <p>生效日期：【2022】年【3】月【1】日</p>
      <br />
      <p>本隐私政策将帮助你了解：</p>
      <br />
      <p>
        （1）【重庆推小果传媒科技有限公司】（注册地址：【重庆两江新区天宫殿街道洪湖东路 9 号
        10-4号】，以下简称“我们”）会遵循隐私政策收集、使用你的信息，但不会仅因你同意
        本隐私政策而采用强制捆绑的方式一揽子收集个人信息；
      </p>
      <br />
      <p>
        （2）当你使用或开启相关功能或使用服务时，为实现功能、服务所必需，我们会收集、使
        用相关信息。除非是为实现基本业务功能或根据法律法规要求所必需的必要信息，你可以拒
        绝提供且不影响其他功能或服务； <br />
      </p>
      <br />
      <p>
        （3）我们会将在境内运营过程中收集和产生的你的个人信息存储于中华人民共和国境内，
        不会将上述信息传输至境外。我们仅会在为提供“力推联盟”及相关服务之目的所必需的期
        间内保留你的个人信息； <br />
      </p>
      <br />
      <p>
        （4）我们将努力采取合理的安全措施来保护你的个人信息。特别的，我们将采用行业内通
        行的方式及尽最大的商业努力来保护你个人敏感信息的安全； <br />
      </p>
      <br />
      <p>
        （5）你访问、更正、删除个人信息与撤回同意授权的方式，以及取消授权、意见反馈的方 式。 <br />
      </p>
      <br />
      <p>
        我们非常重视用户个人信息的保护，并且将以勤勉和审慎的义务对待这些信息。你在开启、
        授权登录、使用、取消授权（以下统称“使用”）“ 力推联盟”及相关服务时，我们将按照
        本《隐私政策》收集、保存、使用、共享、披露及保护你的个人信息。我们希望通过本《隐
        私政策》向你介绍我们对你个人信息的处理方式，因此我们建议你认真完整地阅读本《隐私
        政策》的所有条款。其中，与你信息及权利相关的内容将以加粗的形式提示你注意，请你重 点阅读。
        <br />
      </p>
      <br />
      <p>本隐私政策旨在帮助你了解以下内容： <br /></p>
      <p>
        一、我们如何收集和使用个人信息 <br />
        二、对 Cookie 和同类技术的使用 <br />
        三、我们如何存储个人信息 <br />
        四、我们如何共享、转让、公开披露个人信息 <br />
        五、我们如何保护个人信息的安全 <br />
        六、你的权利 <br />
        七、未成年人使用条款 <br />
        八、隐私政策的修订和通知 <br />
        九、适用范围 <br />
      </p>
      <br />

      <h3>一、我们如何收集和使用个人信息</h3>
      <br />
      <p>
        在你使用“力推联盟”及服务的过程中，我们将根据合法、正当、必要的原则，收集信息。
        <br />
        我们收集或请你提供的信息将用于： <br />
        <br />
      </p>
      <br />
      <p>
        保障产品的基础正常运行； <br />
        实现各项功能和服务； <br />
        优化、改善产品和服务； <br />
        保障产品、服务以及用户使用安全； <br />
        遵循法律法规与国家标准的规定。 <br />
      </p>
      <br />

      <h4>（一）我们如何收集与使用的个人信息</h4>
      <br />
      <p>
        我们会按照如下方式收集你在使用服务时主动提供的，以及通过自动化手段收集你在使用功
        能或接受服务过程中产生的信息： <br />
      </p>
      <br />
      <h4>1.授权登录“力推联盟”和相关服务</h4>
      <br />
      <p>
        当你使用“力推联盟”及相关服务时，你需要通过绑定的手机号进行授权登录，经过你的同
        意，我们会收集你绑定的手机号，此外，你还可以自主选择设置手机号和密码，便于使用手
        机号和密码进行登录，收集这些信息是为了帮助你完成注册和登录。你还可以填写邮箱来完
        善你的信息。我们收集手机号、邮箱还会用于与你联系并与你沟通任务相关信息。<br />
      </p>
      <br />
      <h4>2.身份认证</h4>
      <br />
      <p>
        为了保证力推联盟任务的参与以及签署电子协议所需身份认证，你还需要完善姓名、电话号
        码、身份证号、银行账户信息。上述信息中可能包含个人敏感信息（如电话号码、身份证号、
        银行账户），是进行身份认证以及收到转账所必要的，如果你拒绝提供这些信息，我们将可
        能无法向你提供相关功能和服务。 <br />
      </p>
      <br />
      <h4>3.参与任务与任务推荐</h4>
      <br />
      <p>
        （1）你使用拍摄视频、上传视频功能时，需要你在你的设备中向我们开启你的相机、相册
        权限。你如果拒绝授权提供，将无法使用此功能，但不影响你正常使用“力推联盟”的其他 功能。 <br />
        （2）我们可能会收集你主动选择的任务类型兴趣标签以便于为你提供任务筛选服务。
        <br />
        （3）你还可填写自己的性别，我们可能基于该信息为你推荐更适合你的任务或内容。
        <br />
      </p>
      <br />
      <h4>4.保障产品、服务及用户使用安全</h4>
      <br />
      <p>
        为帮助我们更好地了解“力推联盟”及相关服务的运行情况，以便确保运行与提供服务的安
        全，我们可能记录网络日志信息，以及使用软件及相关服务的频率、崩溃数据、总体安装、
        使用情况、性能数据信息。 <br />
      </p>
      <br />

      <h4>（二）收集、使用个人信息目的变更的处理</h4>
      <br />
      <p>
        请你了解，随着我们业务的发展，可能会对“力推联盟”的功能和提供的服务有所调整变化。
        原则上，当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与
        原处理目的具有直接或合理关联。在与原目的无直接或合理关联的场景下，我们收集、使用
        你的个人信息，会再次进行告知，并征得你的同意。 <br />
      </p>
      <br />

      <h4>（三）依法豁免征得同意收集和使用的个人信息</h4>
      <br />
      <p>
        请你理解，在下列情形中，根据法律法规及相关国家标准，我们收集和使用你的个人信息无
        需征得你的授权同意： <br />
      </p>
      <br />
      <p>
        （1）与国家安全、国防安全直接相关的； <br />
        （2）与公共安全、公共卫生、重大公共利益直接相关的； <br />
        （3）与犯罪侦查、起诉、审判和判决执行等直接相关的； <br />
        （4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同 意的；
        <br />
        （5）所收集的你的个人信息是你自行向社会公众公开的； <br />
        （6）从合法公开披露的信息中收集的你的个人信息的，如合法的新闻报道、政府信息公开 等渠道；
        <br />
        （7）根据你的要求签订或履行合同所必需的； <br />
        （8）用于维护“力推联盟”及相关服务的安全稳定运行所必需的，例如发现、处置力推联
        盟软件及相关服务的故障； <br />
        （9）为合法的新闻报道所必需的； <br />
        （10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描
        述的结果时，对结果中所包含的个人信息进行去标识化处理的； <br />
        （11）法律法规规定的其他情形。 <br />
        特别提示你注意，如信息无法单独或结合其他信息识别到你的个人身份，其不属于法律意义
        上你的个人信息；当你的信息可以单独或结合其他信息识别到你的个人身份时或我们将无法
        与任何特定个人信息建立联系的数据与其他你的个人信息结合使用时，则在结合使用期间，
        这些信息将作为你的个人信息按照本隐私政策处理与保护。 <br />
      </p>
      <br />

      <h3>二、对 cookie 和同类技术的使用</h3>
      <br />
      <p>
        cookie和同类技术是互联网中的通用常用技术。当你使用“力推联盟”及相关服务时，我
        们可能会使用相关技术向你的设备发送一个或多个 cookie 或匿名标识符，以收集和存储你
        访问、使用本产品时的信息。我们使用 cookie 和同类技术主要为了使我们确认你是否安全
        登录服务，或者是否遇到盗用、欺诈等不法行为。这些技术还会帮助我们更好地为你提供服 务。 <br />
      </p>
      <br />

      <h3>三、我们如何存储个人信息</h3>
      <br />
      <h4>（一）信息存储的地点</h4>
      <br />
      <p>
        我们依照法律法规的规定，将在境内运营过程中收集和产生的你的个人信息存储于中华人民
        共和国境内。目前，我们不会将上述信息传输至境外，如果我们向境外传输，我们将会遵循
        国家相关规定，征求你的同意。 <br />
        <br />
      </p>
      <br />
      <h4>（二）存储期限</h4>
      <br />
      <p>
        我们仅在为提供“力推联盟”及服务之目的所必需的期间内保留你的个人信息，在你未删除
        或未注销账号期间，我们会保留相关信息。超出必要期限后，我们将对你的个人信息进行删
        除或匿名化处理，但法律法规另有规定的除外。 <br />
      </p>
      <br />

      <h3>四、我们如何共享、转让、公开披露个人信息</h3>
      <br />
      <h4>（一）个人信息的共享、转让</h4>
      <br />
      <p>
        我们不会向第三方共享、转让你的个人信息，除非经过你本人事先授权同意，或者共享、转
        让的个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主体。
      </p>
      <br />
      <h4>1.在下列情况下，我们可能会共享的个人信息</h4>
      <br />
      <p>
        当你选择参加“力推联盟”任务时，根据活动需要你可提供姓名、联系方式、银行账号等信
        息，以便第三方能及时向你提供奖品。经过你的明示同意，我们会将上述信息与第三方共享，
        以便我们能委托第三方及时向你提供奖品。 <br />
      </p>
      <br />
      <h4>2.对共享个人信息第三方主体的谨慎评估及责任约束</h4>
      <br />
      <p>
        （1）经你同意，我们只会与第三方共享实现目的所必要的信息。如果第三方因业务需要，
        确需超出前述授权范围使用个人信息的，该第三方将需再次征求你的同意。
        <br />
        （2）对我们与之共享你个人信息的第三方，该些第三方会与我们签订保密协议。同时，我
        们会对其数据安全能力与环境进行评估并要求第三方以不低于本隐私政策所要求的保密和
        安全措施来处理该些信息。 <br />
      </p>
      <br />
      <h4>3.收购、兼并、重组时个人信息的转让</h4>
      <br />
      <p>
        随着我们业务的持续发展，我们将有可能进行合并、收购、资产转让，你的个人信息有可能
        因此而被转移。在发生前述变更时，我们将按照法律法规及不低于本隐私政策所要求的安全
        标准继续保护或要求个人信息的继受方继续保护你的个人信息，否则我们将要求继受方重新
        征得你的授权同意。 <br />
      </p>
      <br />
      <h4>（二）个人信息的公开披露</h4>
      <br />
      <p>
        除对违规账号、欺诈行为进行处罚公告时，我们会披露相关账号的必要信息外，我们不会公
        开披露你的信息，除非遵循国家法律法规规定或者获得你的同意。我们公开披露你的个人信
        息会采用符合行业内标准的安全保护措施。 <br />
      </p>
      <br />
      <h4>
        （三）依法豁免征得同意共享、转让、公开披露的个人信息请你理解，在下列情形中，根
        据法律法规及国家标准，我们共享、转让、公开披露你的个人信息无需征得你的授权同意
      </h4>
      <br />
      <p>
        （1）与国家安全、国防安全直接相关的； <br />
        （2）与公共安全、公共卫生、重大公共利益直接相关的； <br />
        （3）与犯罪侦查、起诉、审判和判决执行等直接相关的； <br />
        （4）出于维护你或其他个人的生命、财产等重大合法权益但又很难得到你的同意的；
        <br />
        （5）你自行向社会公众公开的个人信息； <br />
        （6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
        <br />
      </p>
      <br />

      <h3>五、我们如何保护个人信息安全</h3>
      <br />
      <p>
        （一）我们非常重视你个人信息的安全，将努力采取合理的安全措施（包括技术方面和管理
        方面）来保护你的个人信息，防止你提供的个人信息被不当使用或未经授权的情况下被访问、
        公开披露、使用、修改、损坏、丢失或泄漏。 <br />
      </p>
      <br />
      <p>
        （二）我们会使用不低于行业同行的加密技术、匿名化处理等合理可行的手段保护你的个人
        信息，并使用安全保护机制防止你的个人信息遭到恶意攻击。 <br />
      </p>
      <br />
      <p>
        （三）我们会建立专门的安全部门、安全管理制度、数据安全流程保障你的个人信息安全。
        我们采取严格的数据使用和访问制度，确保只有授权人员才可访问你的个人信息，并适时对
        数据和技术进行安全审计。 <br />
      </p>
      <br />
      <p>
        （四）尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请你
        理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安
        全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保你提供给我们的个人信息
        的安全性。你知悉并理解，你接入我们的服务所用的系统和通讯网络，有可能因我们可控范
        围外的因素而出现问题。因此，我们强烈建议你采取积极措施保护个人信息的安全，包括但
        不限于使用复杂密码（如有）、定期修改密码（如有）、不将自己的账号密码等个人信息透露 给他人。
        <br />
      </p>
      <br />
      <p>
        （五）我们会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻
        止该等安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失等）后，我们
        将按照法律法规的要求，及时向你告知：安全事件的基本情况和可能的影响、我们已经采取
        或将要采取的处置措施、你可自主防范和降低风险的建议、对你的补救措施等。我们将及时
        将事件相关情况以站内信等形式告知你，难以逐一告知时，我们会采取合理、有效的方式发
        布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。
        <br />
      </p>
      <br />
      <p>
        （六）我们谨此特别提醒你，本隐私政策提供的个人信息保护措施仅适用于“力推联盟”及
        相关服务。一旦你离开“力推联盟”及相关服务，浏览或使用其他网站、服务及内容资源，
        我们即没有能力及义务保护你在“力推联盟”及相关服务之外的软件、网站提交的任何个人
        信息，无论你登录、浏览或使用上述软件、网站是否基于“力推联盟”的链接或引导。
        <br />
      </p>
      <br />

      <h3>六、你的权利</h3>
      <br />
      <p>
        我们非常重视你对个人信息的管理，并尽全力保护你对于你个人信息的访问、修改、删除的
        权利，以使你有能力保障你的隐私和安全。 <br />
      </p>
      <br />
      <h4>（一）访问、修改你的个人信息</h4>
      <br />
      <p>
        当你完成“力推联盟”的授权登录后，你可以通过【个人中心】-【个人信息】-【基础资料】<br />
        访问、修改你提交给“力推联盟”的个人信息。 <br />
      </p>
      <br />
      <h4>（二）删除你的个人信息</h4>
      <br />
      <p>
        当你通过【个人中心】-【联系客服】与我们联系要求删除你的个人信息后，我们会及时进 行处理。
        <br />
      </p>
      <br />
      <h4>（三）注销账号</h4>
      <br />
      <p>
        你可以通过【个人中心】-【联系客服】申请注销账号。在你注销账号前，我们将验证你的
        个人身份、安全状态、设备信息等。你知悉并理解，注销账号的行为是不可逆的行为，当你
        注销账号后，我们将删除有关你的相关信息或进行匿名化处理，但法律法规另有规定的除外。<br />
      </p>
      <br />
      <h4>（四）意见反馈</h4>
      <br />
      <p>
        如果你认为你的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索，你可以通
        过【个人中心】-【联系客服】，进入用户反馈界面与我们联系。我们核查后会及时反馈你的
        意见与建议。 <br />
      </p>
      <br />
      <h4>（五）访问隐私政策</h4>
      <br />
      <p>
        你可以在注册页面，或者在登录个人账号【个人中心】-【个人信息】-【隐私政策】查看本
        隐私政策的全部内容。 <br />
      </p>
      <br />
      <h4>（六）停止运营向你告知权利</h4>
      <br />
      <p>
        如我们停止运营，我们将及时停止收集你个人信息的活动，将停止运营的通知以逐一送达或
        公告的形式通知你，并对所持有的你的个人信息进行删除或匿名化处理。<br />
      </p>
      <br />

      <h3>七、未成年人条款</h3>
      <br />
      <p>
        若你是未满 18周岁的未成年人，在使用“力推联盟”及相关服务前，应在你的父母或其他
        监护人监护、指导下共同阅读并同意本隐私政策。 <br />
      </p>
      <br />
      <p>
        我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他
        监护人明确同意或保护未成年人所必要的情况下收集、使用、共享或披露未成年人的个人信
        息；如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则
        会设法尽快删除相关信息。 <br />
      </p>
      <br />
      <p>
        若你是未成年人的监护人，当你对你所监护的未成年人的个人信息有相关疑问时，请通过本
        隐私政策公示的联系方式与我们联系。 <br />
      </p>
      <br />

      <h3>八、隐私政策的修订和通知</h3>
      <br />
      <p>
        （一）为了给你提供更好的服务，“力推联盟”及相关服务将不时更新与变化，我们会适时
        对本隐私政策进行修订，该等修订构成本隐私政策的一部分并具有等同于本隐私政策的效力。
        但未经你明确同意，我们不会削减你依据当前生效的本隐私政策所应享受的权利。<br />
      </p>
      <br />
      <p>
        （二）本隐私政策更新后，我们会在更新后的条款生效前以适当的方式提醒你更新的内容，
        以便你及时了解本隐私政策的最新版本。 <br />
      </p>
      <br />

      <h3>九、适用范围</h3>
      <br />
      <p>
        本隐私权政策适用于由北京微播视界科技有限公司及其关联方提供的“力推联盟”的所有服
        务，不适用于有单独的隐私权政策且未纳入本隐私权政策的第三方产品或服务。 本隐私政 策不适用于：
        <br />
      </p>
      <br />
      <p>
        其他第三方产品或服务，可能包括在个性化推荐中向你显示的产品或网站和广告内容或者
        “力推联盟”服务中链接到的其他产品或网站； <br />
        通过“力推联盟”绑定的其他第三方平台。 <br />
        你使用这些第三方服务（包括你向这些第三方提供的任何个人信息），将受这些第三方的服
        务条款及隐私政策约束（而非本隐私政策），具体规定请你仔细阅读第三方的条款。请你妥
        善保护自己的个人信息，仅在必要的情况下向第三方提供。 <br />
      </p>
      <br />
      <p>
        本隐私政策中所述的“力推联盟”及相关服务有可能会根据你所使用的手机型号、系统版本、
        软件应用程序版本等因素而有所不同。最终的产品和服务以你所使用的“力推联盟”及相关 服务为准。
        <br />
      </p>
      <br />
      <p>
        如对本隐私政策内容有任何疑问、意见或建议，你可通过登录“力推联盟”内的【个人中心】
        -【联系客服】界面方式与我们联系。 <br />
      </p>
      <br />
    </div>
  </div>
</template>

<script>
  export default {
    name: 'privacyAgreement',
    computed: {
      // firstRouter() {
      //   return (this.$store.getters && this.$store.getters.firstRouter) || "/";
      // },
    },
    methods: {
      // back() {
      //   if (this.$route.query.noGoBack) {
      //     this.$router.push({ path: "/" });
      //   } else {
      //     this.$router.go(-1);
      //   }
      // },
    },
  };
</script>

<style lang="scss" scoped>
  .AgreementPrivacy {
    position: relative;
    width: 90vw;
    height: 90vh;
    margin: 5% auto;

    .txtbox {
      overflow: scroll;
      position: absolute;
      left: 50%;
      top: 50%;
      transform: translate(-50%, -50%);
      width: 90%;
      height: 90%;
    }
  }
</style>
