<template>
  <div class="AgreementUser">
    <div class="txtbox">
      <h2>力推联盟达人用户协议</h2>
      <br />
      <p> 尊敬的用户，欢迎您使用力推联盟达人小程序（下称“力推小程序”）及相关服务。 </p>
      <br />
      <p>
        为更好地为您提供服务，请您仔细阅读《力推联盟达人用户协议》（下称“用户协议”、“本
        协议”）。在您开始使用力推小程序及相关服务之前，请您务必仔细阅读并充分理解本协议，
        特别是涉及免除或者限制责任的条款、法律适用和争议解决条款等。其中，免除或者限制责
        任条款等重要内容将以加粗形式提示您注意，您应重点阅读。如您未满 18 周岁，请您在法
        定监护人陪同下仔细阅读并充分理解本协议，并征得法定监护人的同意后使用力推小程序及 相关服务。
      </p>
      <br />

      <h4>一.适用范围</h4>
      <br />
      <p>
        本协议是您与本公司（以下简称“公司”或“我们”）之间就您登录、注册、使用力推小程
        序，并获得力推小程序提供的相关服务所订立的协议。公司有权依力推小程序及相关服务或
        运营的需要单方决定，安排或指定其关联公司、控制公司、继承公司或公司认可的第三方公
        司继续运营力推小程序。并且，就本协议项下涉及的某些服务，可能会由公司的关联公司、
        控制公司、继承公司或公司认可的第三方公司向您提供。您知晓并同意接受相关服务内容，
        即视为接受相关权利义务关系亦受本协议约束。您与公司之间就您加入达人力推联盟（下称
        “力推联盟”）、领取力推联盟拍摄任务以及您完成力推联盟拍摄任务所获得奖励金额的支付
        事宜将由您与公司或公司的关联公司、控制公司之间的书面协议另行约定。<br />
        “用户”指所有直接或间接获取和使用力推小程序及相关服务的使用者，即自然人。在本协
        议中称为“用户”或称“您”。<br />
        “达人力推联盟”指为了推广公司集团旗下各产品和品牌及公司指定的外部广告主产品及品
        牌，公司会定期或不定期发布需求产品的市场推广或广告素材拍摄制作的任务需求，邀请网
        络达人领取任务参与创作创意广告视频、音频、海报等的拍摄，经公司评估对优质广告作品
        予以采用并对创作者给予相应奖励的活动。<br />
        “达人”指已经开通社交平台（包括不限于抖音、头条、火山、西瓜、微博、快手、小红书
        等）账号且领取力推联盟拍摄任务的用户，拥有一定影响力及自媒体资源并有权接受公司发
        布的力推联盟拍摄任务，并提供相应广告创意作品的个人，本协议中称为“达人”。<br />
        本协议内容同时包含公司已经发布及后续可能不断发布、更新的关于力推小程序及力推联盟
        的相关协议、规则、系统通知、公告等内容。前述内容自公告、通知之日或公告、通知载明
        之日起生效，并成为本协议不可分割的组成部分，您在前述内容生效之后，仍继续使用力推
        小程序、参与力推联盟的，视为您接受和自愿遵守前述内容。<br />
      </p>
      <br />

      <h4>二.使用力推小程序及相关服务</h4>
      <br />
      <p>
        您使用力推小程序及相关服务，可以通过公司已授权的第三方下载等方式获取力推小程序应
        用程序。若您并非从公司或经公司授权的第三方获取本应用程序的，公司无法保证非官方版
        本的力推小程序能够正常使用，您因此遭受的损失与公司无关。<br />
        公司可能为不同的终端设备开发了不同的应用程序软件版本，您应当根据实际设备状况获取、
        下载、安装合适的版本。<br />
        您可根据自行需要使用力推小程序及相关服务，如您不再需要使用力推小程序及相关服务并
        希望删除相关个人信息，您可以通过【个人中心】-【联系客服】途径与我们联系。<br />
        为更好的提升用户体验及服务，公司将不定期提供力推小程序软件更新或改变（包括但不限
        于软件修改、升级、功能强化、开发新服务、软件替换等），用户同意使用更新后的版本或 服务。<br />
        除非得到公司明示事先书面授权，您不得以任何形式对力推小程序及相关服务进行包括但不
        限于改编、复制、传播或交易等未经授权的访问或使用。<br />
        您理解，您使用力推小程序及相关服务需自行准备与软件及相关服务有关的终端设备（如手
        机等装置），一旦您在其终端设备中打开力推小程序，即视为您使用力推小程序及相关服务。
        为充分实现力推小程序的全部功能，您可能需要将其终端设备联网，您理解由您承担所需要
        的费用（如流量费、上网费等）。<br />
        公司许可您个人的、可撤销的、不可转让的、非独占地和非商业的合法使用力推小程序及相
        关服务的权利。本协议未明示授权的其他一切权利仍由公司保留，您在行使该些权利时须另
        行获得公司的书面许可，同时公司如未行使前述任何权利，并不构成对该权利的放弃。<br />
        您登录/注册后即可开始使用力推小程序及相关服务。同时，您也理解，为使您更好地使用
        力推小程序及相关服务，保障您的账号安全，某些功能和/或某些单项服务项目，如领取力
        推联盟任务等，要求您按照国家相关法律法规的规定，提供真实的身份信息、银行信息等必
        要信息后方可使用。<br />
        您通过已注册或者已同步的账号登录公司及/或关联方运营的系列客户端软件产品及网站时，
        应遵守该软件产品及网站自身的用户协议及其他协议条款的规定。<br />
        如您在力推小程序使用过程中有任何疑问、咨询、投诉或申诉，请立即通过包括不限于意见
        反馈方式与公司联系，公司会尽快解决您的问题，必要时请提供您有相关权利的初步证据，
        公司将会根据当地法律规定及时处理您的投诉。如您在力推小程序或相关平台发布的内容被
        相关权利人投诉侵权，您也可以通过提交相关权利证明材料，来向公司进行申诉，公司同样
        将会根据当地法律规定及时处理您的申诉。<br />
      </p>
      <br />

      <h4>三.关于使用力推小程序参与力推联盟</h4>
      <br />
      <p>
        您理解力推联盟的任务是在力推小程序上进行发布，您同意使用您手机登录等形式登录力推
        小程序，通过领取推广任务来参与力推联盟。<br />
        公司在此特别提示您：为了保障您的账户的安全性，您有责任妥善保管并维护您账号、密码
        的安全性与保密性。在任何情况下不向他人透露账号及密码。若发现他人未经许可使用您的
        账号或发生其他任何安全漏洞问题时，您应当立即通知公司。<br />
        公司特别提醒您应妥善保管您的账号和密码。当您使用完毕后，应安全退出。<br />
      </p>
      <br />

      <h4>四.力推联盟的参与规范</h4>
      <br />
      <p>
        一旦您点击选择参与力推联盟，您应按照公司对于力推联盟具体任务的管理流程和任务要求
        及时完成创作，并及时按照公司的时间要求在各阶段（脚本创作、视频拍摄、后期制作等）
        上传提交创作成果给公司进行验收评估。<br />
        您理解并同意力推联盟的奖励评级方式是由公司根据相应的后台系统数据及作品质量等因
        素综合评定得出，您参与力推联盟即视为您对公司的奖励评定方式和评定结果表示接受和同
        意。否则，您无权参与力推联盟。<br />
        在公司对您提交的创作成果验收完成后，如公司评定您的创作成果应当获得奖励的，则公司
        依据本协议及您与公司之间另行签订的书面协议的约定给予您奖金奖励并进行费用结算或
        通过第三方代理公司结算。<br />
        您同意并理解，因参与力推联盟所产生的全部成本均应由您自行承担，除您与公司或其关联
        公司另行签订书面协议进行约定之外，您无权向公司要求任何形式的费用支付。<br />
        您理解并承诺，您在使用力推联盟程序软件及相关服务时发布、上传或传输的所有内容（包
        括但不限于文字、图片、视频、音频等各种形式的内容及其中包含的音乐、声音、台词、视
        觉设计、对话等所有组成部分）均由您原创或已获合法授权（且含转授权）。您通过力推联
        盟程序上传、发布所产生内容的知识产权归属您或原始著作权人所有。<br />
        您知悉、理解并同意，您通过力推联盟程序软件及相关服务上传、发布或传输的所有内容（包
        括但不限文字，图片，视频，音频，视频等各种形式的内容及其中包括的音乐、声音、台词、
        视觉设计、对话等所有组成部分），您授予公司及其关联方、控制公司、继承公司及公司授
        权的其他第三方一项全球范围内、免费、独家、可再许可（通过多层次）的权利（包括但不
        限于复制权、翻译权、汇编权、信息网络传播权、改编权、制作衍生品、表演和展示等权利），
        使用范围包括但不限于在当前或其他应用程序、网站、产品或终端设备等。您在此确认并同
        意，上述授予的权利包括在与上述内容、力推联盟程序软件及相关服务、公司和/或公司品
        牌有关的任何宣传、推广、广告、营销和/或研究中使用和以其他方式开发内容（全部或部
        分）的权利和许可。为避免疑义，您理解并同意，上述授予的权利包括使用、复制和展示您
        拥有或被许可使用并植入内容中的个人形象、肖像、姓名、商标、服务标志、品牌、名称、
        标识和公司标记（如有）以及任何其他品牌、营销或推广资产、物料、素材等的权利和许可。
        您理解并同意，公司为了整体运营或业务的需要，有权以通知的方式修改、中断、中止或终
        止相关任务的发布和执行或整个力推联盟，而无须向您负责或承担任何赔偿责任。<br />
      </p>
      <br />

      <h4>五.用户信息的保护与使用</h4>
      <br />
      <p>
        我们非常重视用户信息的保护，保护用户个人信息是公司的基本原则之一。公司与用户一同
        致力于用户个人信息（即能够独立或与其他信息结合后识别用户身份的信息）的保护。<br />
        在使用力推小程序及相关服务的过程中，您可能需要提供您的个人信息（包括但不限于您的
        姓名、电话号码、位置信息、设备信息等），以便公司向您提供更好的服务和相应的技术支
        持。您理解并同意，公司有权在遵守法律法规、本协议以及《达人力推联盟隐私政策》的前
        提下，收集、使用（含商业合作使用）、存储和分享您的个人信息，同时，我们将依法保护
        您浏览、修改、删除相关个人信息以及撤回同意的权利。<br />
        如您选择参与力推联盟时，您应保证您填写的信息的真实性、准确性。公司 有权对您提交
        的信息（包括但不限于资质文件等）进行审核。若您提交的材料或提供的信息不准确、不真
        实、不合法或者公司有理由怀疑为错误、不实或不合法的资料，公司有权拒绝为您提供相关
        服务或您可能无法使用力推小程序及相关服务或在使用过程中部分功能受到限制、拒绝您参
        与力推联盟。如您已在公司的关联公司所有或经授权合法运营的相关平台提供过相关资质文
        件，并经过验证（包括但不限于第三方对公验证等形式），您理解并同意，公司有权调取相
        关数据进行匹配。如未匹配一致，公司有权不予审核通过。<br />
        您理解并同意，公司有权保存您参与力推联盟所提交的信息和资料（包括但 不限于您的账
        户信息、任务信息、身份信息、联系方式、上传视频等）；公司在法律法规所允许的范围内，
        有权使用和对外披露您的信息，包括但不限于抽样测试、更新的目的，出于提升互联网诚信
        环境的目的、依据司法和/或行政机关的要求使用或披露您的信息。公司有可能对相关数据
        进行整理分析并用于进一步优化或拓展相关业务；公司或经公司授权的关联公司也可能会出
        于运营需要将您的使用情况作为相关服务的案例进行展示或参与相关评奖。<br />
        考虑到力推小程序及相关服务中可能包括或链接至第三方提供的信息或其他服务（包括网
        站）。您知悉并理解，运营该等服务的第三方可能会要求您提供个人信息。公司特别提醒您，
        需要认真阅读该等第三方的用户协议、隐私政策以及其他相关的条款，妥善保护自己的个人
        信息，仅在必要的情况下向该等第三方提供。本协议（以及其他与力推小程序及相关服务相
        关的协议和规则（包括但不限于《达人力推联盟隐私政策》）不适用于任何第三方提供的服
        务，公司对任何因第三方使用由您提供的个人信息所可能引起的后果不承担任何法律责任。
        更多关于用户个人信息保护的内容，请参看《达人力推联盟隐私政策》。<br />
      </p>
      <br />

      <h4>六.用户行为规范</h4>
      <br />
      <p>
        您在为参与力推联盟而创作和发布的内容应自觉遵守相应法律、法规，尊重公共秩序，尊重
        社会公德、社会主义制度、国家利益、公民合法权益、道德风尚和信息真实性等要求。您同
        意并承诺不制作、发布法律、行政法规禁止的下列信息内容：<br />
      </p>
      <br />
      <p>
        (1) 反对宪法确定的基本原则的；<br />
        (2) 危害国家安全，泄露国家秘密的；<br />
        (3) 颠覆国家政权，推翻社会主义制度、煽动分裂国家、破坏国家统一的；<br />
        (4) 损害国家荣誉和利益的；<br />
        (5) 宣扬恐怖主义、极端主义的；<br />
        (6) 宣扬民族仇恨、民族歧视，破坏民族团结的；<br />
        (7) 煽动地域歧视、地域仇恨的；<br />
        (8) 破坏国家宗教政策，宣扬邪教和迷信的；<br />
        (9) 编造、散布谣言、虚假信息，扰乱经济秩序和社会秩序、破坏社会稳定的；<br />
        (10) 散布、传播暴力、淫秽、色情、赌博、凶杀、恐怖或者教唆犯罪的；<br />
        (11) 侵害未成年人合法权益或者损害未成年人身心健康的；<br />
        (12) 未获他人允许，偷拍、偷录他人，侵害他人合法权利的；<br />
        (13) 包含恐怖、暴力血腥、高危险性、危害表演者自身或他人身心健康内容的；<br />
        (14) 危害网络安全、利用网络从事危害国家安全、荣誉和利益的；<br />
        (15) 侮辱或者诽谤他人，侵害他人合法权益的；<br />
        (16) 对他人进行暴力恐吓、威胁，实施人肉搜索的；<br />
        (17) 涉及他人隐私、个人信息或资料的；<br />
        (18) 散布污言秽语，损害社会公序良俗的；<br />
        (19) 侵犯他人隐私权、名誉权、肖像权、知识产权等合法权益内容的；<br />
        (20) 散布商业广告，或类似的商业招揽信息、过度营销信息及垃圾信息；<br />
        (21) 所发表的信息毫无意义的，或刻意使用字符组合以逃避技术审核的；<br />
        (22) 其他违反法律法规、政策及公序良俗、干扰力推小程序平台正常运营或侵犯其他用户<br />
        或第三方合法权益内容的其他信息。<br />
        您理解并同意，公司并未授权您以任何形式对外宣传或力推联盟以公司名义招募达人。您不
        得用力推联盟的名义公开对外招募达人，不得对外声称自己是力推联盟的主办机构，您对外
        发布的任何与力推联盟相关的文件和物料等包括但不限于活动海报等均需取得公司的事先 书面许可。<br />
      </p>
      <br />
      <p>
        在参与力推联盟时严格遵守公司的要求规范，秉承诚实信用原则，不使用任何违规作弊的方
        式刷量（包括但不限于播放量、点赞量、评论量等）等手段来获取奖金或任何形式的利益或
        好处。否则，公司有权拒绝您参与力推联盟并有权取消您通过违规作弊手段而获得的奖励。
      </p>
      <br />
      <p>
        公司有权不时对您的身份信息、发布内容、账号名称等内容进行审查，如有公司认为不真实、
        不符合法律规定、不符合本协议要求或存在风险的信息，公司有权在不通知您的前提下即进
        行自行处理的权利。公司前述审查行为并不视为公司对您提交的相关信息、内容的合法合规
        性的任何承诺或担保，也不构成公司对您提交的相关信息、内容承担任何连带责任，您应当
        对您的相关信息、内容及全部行为独立负责。<br />
      </p>
      <br />

      <h4>七.违约处理</h4>
      <br />
      <p>
        针对您违反本协议或其他相关协议的行为，公司有权独立判断并视情况采取相应处理措施。
        对涉嫌违反法律法规、涉嫌违法犯罪的行为将保存有关记录，并依法向有关主管部门报告、
        配合有关主管部门调查。<br />
        因您的行为引起第三方投诉或诉讼索赔的，您应当自行处理并承担全部可能由此引起的法律
        责任。因您的违法或违约行为导致公司及其关联公司、控制公司向任何第三方赔偿或遭受国
        家机关处罚的，您还应足额赔偿公司及其关联公司、控制公司因此遭受的全部损失。<br />
      </p>
      <br />

      <h4>八.知识产权</h4>
      <br />
      <p>
        您必须对参与力推联盟而发表或者上传的所有信息（包括但不限于文字、图片、音频、视频、
        链接等）均享有完整的知识产权，或已经得到相关权利人的合法授权，并保证该信息不侵犯
        到任何第三人的合法权益（包括但不限于名誉权、姓名权、肖像权、隐私权、知识产权等）；
        如您违反本条规定造成公司及/或其关联公司被第三人索赔的，您应全额补偿公司及/或其关
        联公司一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)。<br />
        请您在任何情况下都不要私自使用公司及/或其关联公司的任何商标、服务标记、商号、域
        名、网站名称、活动名称（包括但不限于“达人力推联盟”或“力推联盟”等）或其他显著
        品牌特征等（以下统称为“标识”）。未经公司事先书面同意，您不得将本条款前述标识以单
        独或任何结合方式展示、使用或申请注册商标、进行域名注册等，也不得实施向他人明示或
        暗示有权展示、使用、或其他有权处理该些标识的行为。由于您违反本协议使用公司上述商
        标、标识等给公司或他人造成损失的，由您承担全部法律责任。<br />
      </p>
      <br />

      <h4>九.免责条款</h4>
      <br />
      <p>
        您理解并同意，公司提供的力推小程序及相关服务是按照现有技术和条件所能达到的现状提
        供的。公司会尽最大努力向您提供服务，确保服务的连贯性和安全性。您理解，公司不能随
        时预见和防范法律、技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、
        系统不稳定、第三方服务瑕疵及其他各种安全问题的侵扰等原因可能导致的服务中断、数据
        丢失以及其他的损失和风险。<br />
        您理解并同意，公司为了服务整体运营的需要，有权在公告通知后修改、中断、中止或终止
        力推小程序及相关服务，而无须向用户负责或承担任何赔偿责任。<br />
        因不可抗力（包括但不限于政府管制、国家政策调整、恐怖袭击、自然灾害、战争、停电、
        电信部门技术调整以及病毒入侵等）或其它非公司故意行为导致力推联盟不能正常进行或给
        您造成损失的，您同意公司不承担任何责任，也无须向您提供任何赔偿。<br />
        您理解并同意，您是具有完全民事行为能力的自然人，您将对您参与力推联盟的全部行为负
        责。您承诺您参与力推联盟不会侵害任何第三方的合法权益。如因参与力推联盟或其相关活
        动中您导致您自身或者任何第三方的任何形式的人身财产或其它损害或损失的，一切责任均
        由您自行承担。<br />
      </p>
      <br />

      <h4>十.未成年人使用条款</h4>
      <br />
      <p>
        若您是未满 18 周岁的未成年人，在使用力推小程序及相关服务前，应在您的父母或其他监
        护人监护、指导下阅读并同意本协议。<br />
        公司重视对未成年人个人信息的保护，未成年用户在填写个人信息时，请加强个人保护意识
        并谨慎对待，并在监护人指导时正确使用力推小程序及相关服务。<br />
        未成年用户理解如因您违反法律法规、本协议内容，则您及您的监护人应依照法律规定承担
        因此而导致的一切后果。<br />
        未成年人用户特别提示<br />
        4.1 青少年及使用力推小程序及相关服务应该在其监护人的监督指导下，在合理范围内正确
        学习使用网络，避免沉迷虚拟的网络空间，养成良好上网习惯。<br />
        4.2 青少年用户必须遵守《全国青少年网络文明公约》：<br />
        （1）要善于网上学习，不浏览不良信息；<br />
        （2）要诚实友好交流，不侮辱欺诈他人；<br />
        （3）要增强自护意识，不随意约会网友；<br />
        （4）要维护网络安全，不破坏网络秩序；<br />
        （5）要有益身心健康，不沉溺虚拟时空。<br />
        4.3 为更好的保护未成年人隐私权益，公司提醒用户慎重发布包含未成年人素材的内容。<br />
      </p>
      <br />

      <h4>十一.其他</h4>
      <br />
      <p>
        您同意本协议在所有方面均受中华人民共和国法律管辖。<br />
        若您因本协议与公司发生任何争议，双方应尽量友好协商解决；如协商不成的，您同意应将
        相关争议提交至北京市海淀区人民法院诉讼解决。<br />
        公司有权依据国家政策、技术条件、业务调整等变化需要而进行修改本协议，公司会将修改
        后的协议予以发布；前述内容一经正式发布，即作为本协议不可分割的组成部分并具有等同
        于本协议的法律效力。<br />
        本协议中的标题仅为方便及阅读而设，并不影响本协议中任何规定的含义或解释。<br />
        您和公司均为独立的主体，在任何情况下本协议不构成公司对您的任何形式的明示或暗示担
        保，双方之间亦不构成代理、合伙或雇佣关系。<br />
      </p>
      <br />
    </div>
  </div>
</template>

<script>
  export default {
    name: 'userAgreement',
    computed: {
      // firstRouter() {
      //   return (this.$store.getters && this.$store.getters.firstRouter) || "/";
      // },
    },
    methods: {
      // back() {
      //   if (this.$route.query.noGoBack) {
      //     this.$router.push({ path: "/" });
      //   } else {
      //     this.$router.go(-1);
      //   }
      // },
    },
  };
</script>

<style lang="scss" scoped>
  .AgreementUser {
    position: relative;
    width: 90vw;
    height: 90vh;
    margin: 5% auto;

    .txtbox {
      overflow: scroll;
      position: absolute;
      left: 50%;
      top: 50%;
      transform: translate(-50%, -50%);
      width: 90%;
      height: 90%;
    }
  }
</style>
