<template>
  <div class="u-vh-100 u-p-b">
    <div class="u-h-100 scroll-y u-bg-f u-border-radius divboxstyle">
      <div class="title">“_________”共享经济服务协议</div>

      <p><b>重要提示：</b></p>
      <p>
        欢迎您与_________平台运营方<b>【_________】</b>（简称“_________”以及平台发包需方【详见附件1】签署本协议。您签署本协议后将取得_________平台协议分包商的资格，在_________提供项目承揽服务。
      </p>

      <p>
        <span class="highlight">【审慎阅读】</span
        >为维护您的自身权益，请您认真阅读《_________共享经济服务协议》（简称“本协议”）所有内容，务必审慎阅读、充分理解各条款内容。以粗体及下划线标识的条款，您应重点阅读。
      </p>

      <p>
        <span class="highlight">【签约】</span
        >当您按照提示填写您的个人信息并完成本协议的确认/签署后，即表示您已充分阅读、理解并接受本协议的全部内容,
        同意注册成为_________共享经济平台（简称“_________”）用户、开通共享经济服务。在阅读本协议的过程中，如果您不同意本协议或其中任何条款约定，请您立即停止任何形式的协议确认/签署程序。
      </p>

      <div class="section-title">【协议条款】</div>
      <div class="section-title">第一条 合作内容</div>
      <p>
        1.1
        为满足业务发展需要，我司合作伙伴平台发包需方（简称“发包方”）通过发布项目发包信息，您作为平台协议分包商通过_________从事承揽项目分包的业务活动，_________搭建_________共享经济平台，为发包方及分包商之间完成交易提供平台技术服务。
      </p>

      <p>
        1.2
        协议分包商自主选择项目进行接单并按照发包方的要求完成分包项目的实施，分包商与发包方之间自行完成项目实施、交付及费用结算。
      </p>

      <div class="section-title">第二条 协议分包商的权利和义务</div>
      <p>
        2.1
        鉴于_________仅招募自由职业者或个体工商户或临时税务登记纳税人为协议分包商，如您不属于自由职业者或个体工商户或临时税务登记纳税人，请拒绝签署本协议并停止注册或使用_________平台。如您不属于自由职业者或个体工商户或临时税务登记纳税人仍注册成为_________协议分包商的，所有法律责任由您自行承担。
      </p>

      <p>
        2.2
        您在_________注册时，以自由职业者的身份注册_________账户的，您应配合完成_________的用户认证流程，包括但不限于如实填报个人身份信息、联系信息、银行账户信息、上传身份证正反面照片等环节，并应根据税务部门及相关机构的监管要求配合完成临时税务登记的申办流程。包括但不限于通过税务局指定的第三方系统平台进行实名认证、活体认证等环节。
      </p>
      <p class="head-right-text">
        <strong
          >特别提示：如您不同意以临时税务登记纳税人身份注册_________的，则您应明确拒绝进行活体认证流程，否则由此产生的所有相关法律责任均由您自行承担。</strong
        >
      </p>

      <p>
        2.3
        您的签约信息（包括姓名、身份证号、身份证正反面照片、联系电话、银行账户信息等），以您线上或线下提供的信息为准。您承诺并保证您所提供的签约信息均是真实、准确、完整、有效且合法的，如信息变更应及时通知_________。
      </p>

      <p>
        2.4
        您有权自主决定是否承揽相关分包项目，您自备生产经营所需要的设备设施、自行承担生产经营活动中发生的必要费用，您独立完成分包项目的实施。
      </p>

      <p> 2.5 您在决定是否承揽相关分包项目之前，如您存在下列所述情形的，应及时告知发包方： </p>
      <ul>
        <li>(1) 您是服务企业的法定代表人、股东、董事、监事或高级管理人员；</li>
        <li> (2) 您与服务企业具有劳动/劳务合同关系或其他类似的劳动人事法律关系； </li>
        <li>(3) 您属于外籍人员，或港澳台人士，或公职人员（含军人）。</li>
      </ul>
      <p> 如存在前述情形但未告知发包方且仍承接相关分包项目的，所有相关法律责任均由您自行承担。 </p>

      <p>
        2.6
        服务期间，您应按照发包方的有关服务内容及交付质量标准的要求，按时尽责地完成发包方的服务任务，并达到规定的质量标准，不得侵犯他人知识产权、财产权、人身权、肖像权、隐私权、商业秘密或其他合法权益，不得违反国家法律法规、国家政策，不得有悖公序良俗。
      </p>

      <p>
        2.7
        未经_________书面许可，您不得披露或转让在履行合同过程中获悉的_________及发包方的任何商业信息；保密期限为协议期内以及协议终止后十年内。
      </p>

      <p>
        2.8
        您同意_________及发包方收集您的个人信息，包括但不限于姓名、身份证号、身份证正反面照片、联系电话、银行账户信息等。
      </p>

      <div class="section-title">第三条 平台运营方及发包方的权利和义务</div>
      <p>
        3.1 平台运营方及发包方可以留存为实现本次合作内容从您处获取的您的个人信息，并
        承诺对您所披露的个人信息进行保密，未经您授权或非基于合法并可执行的法院命令、监管
        机构的要求或非为履行网络安全保护义务或非应对网络安全事件的需要，平台运营方及发包
        方不得将您的个人信息披露给第三方，如违反此约定造成您相应经济损失的，平台运营方及
        发包方将承担该损失的全部赔偿责任。
      </p>

      <p>
        平台运营方承诺按照相关法律法规的要求对您的个人信息履行安全保护义务，保障网络免受干扰、破坏或未经授权的访问，防止网络数据泄露或被窃取、篡改。
      </p>

      <p>
        3.2
        协议期内，发包方有权根据项目的服务内容和服务质量等要求，对分包项目制定具体的进度安排和验收标准，您应遵守。
      </p>

      <p>
        3.3
        发包方将对您交付的工作成果进行验收。发包方对您交付的项目成果验收通过后，将按约定及时向您支付项目分成款。
      </p>

      <p>
        3.4
        您与发包方通过本协议建立业务外包合作关系。您与发包方不构成任何劳动法律层面的雇佣、劳动、劳务关系，发包方不承担您任何社保福利待遇，也不负责您的任何医疗保险费用（包括但不限于商业保险）。
      </p>

      <div class="section-title">第四条 项目分成款的支付</div>
      <p>
        4.1
        发包方将根据项目完成情况向您支付项目分成款。由于您所承揽的项目情况的不同，该等项目分成款金额可能呈现浮动，您清楚并了解该等浮动为正常情况。发包方以人民币形式向您支付项目分成款；对于您因取得项目分成款应缴纳的个人所得税及其他相关税费由发包方按照本协议第六条之约定进行处理。
      </p>

      <p>
        4.2
        发包方将通过银行转账的方式向您支付项目分成款。您应向发包方提供您本人的实名账户信息，若具体账户信息在_________或发包方认可的其他网络平台在线提供的，以您在线提供的信息为准。
      </p>

      <p>
        4.3
        项目分成款支付以您提供的收款账号为准。因您提供的收款账号错误或不实造成的一切损失由您自行承担。如您账号变更或发生无法使用等情况时，应及时书面通知发包方进行变更操作，否则，由此造成的一切损失由您自行负责。
      </p>

      <div class="section-title">第五条 违约责任</div>
      <p>
        5.1
        本协议对各方均有约束力和可执行力。若任何一方未能履行其在本协议项下之义务或责任，应视为违反本协议，由该违约方负责赔偿守约方因该违约行为而遭受的经济损失及维权费用（包括但不限于诉讼或仲裁费用、律师费、差旅费、鉴定费、公证费等合理费用）。
      </p>

      <p>
        5.2
        因不可抗力因素致使无法实现合同目的，任何一方可以终止或解除本协议。但发生不可抗力一方应及时将有关情况通知其余各方，并尽最大努力进行补救。本协议所称不可抗
        力是指不能预见、不能克服并不能避免且对一方当事人造成重大影响的客观事件，包括但不
        限于自然灾害如洪水、地震、火灾和风暴等以及社会事件如战争、动乱、政府行为、黑客事
        件、大范围电信事故等。
      </p>

      <p>
        5.3 任何由于您声明不实或违反您声明承诺事项致他方向<span class="highlight">_________</span
        >或发包方提起诉讼、索赔及/或导致<span class="highlight">_________</span
        >或发包方声誉受损之后果，您将承担<span class="highlight">_________</span
        >或发包方因此产生的全部直接及间接费用，包括但不限于诉讼支付的律师费等。
      </p>

      <p>
        5.4 您违反本协议下任何规定的，<span class="highlight">_________</span
        >有权单方面采取相应限制或处罚措施，包括但不限于：限制、关闭、终止您的<span class="highlight"
          >_________</span
        >平台账号并根据实际情况决定是否恢复使用。
      </p>

      <p>
        您交付的项目成果或提供的服务不符合发包方的要求，发包方有权单方面采取相应限制或处罚措施，包括但不限于：扣除您账户尚未结算的项目分成款或暂停结算支付。
      </p>

      <p>
        5.5 如因国家政策或税务部门政策等调整，<span class="highlight">_________</span
        >认为有必要解除本协议的，您认可并同意<span class="highlight">_________</span
        >有权单方面无条件解除本协议且无需承担任何违约责任。
      </p>

      <p>
        5.6 出现以下情形之一的，<span class="highlight">_________</span
        >有权随时解除本协议，并有权要求您承担相应违约责任，赔偿相应损失：
      </p>

      <ul>
        <li>
          (1) 您在使用<span class="highlight">_________</span>服务时存在严重损害<span
            class="highlight"
            >_________</span
          >利益的行为；
        </li>
        <li>
          (2) 您利用、借助<span class="highlight">“_________”</span>谋取不正当利益或从事任何非法活动；
        </li>
        <li>
          (3) 您不符合税务部门或<span class="highlight"></span>的身份真实性核查要求；
        </li>
        <li>(4) 您违反对本协议所做的声明与承诺的；</li>
      </ul>

      <div class="section-title">第六条 涉税事务委托授权</div>
      <p class="highlight">
        6.1
        您委托发包方代理本合同交易项下项目分成款的涉税事务和工商事务，包括临时税务登记、申报、注销、代办注册个体工商户、代办税务登记、代理记账、代理报税、代开发票、代开个人完税证明等。
      </p>

      <p>
        6.2 您确认：您在_________提交的涉税相关的申报资料是真实、完整、准确且符合有关法律法规的。
      </p>

      <div class="section-title">第七条 适用法律、争议及纠纷解决和司法管辖</div>
      <p>
        本协议的订立、执行和解释及争议的解决均应适用中国法律。凡因本协议引起的或与本协议有关的任何争议，应友好协商解决。如不能协商解决，一致同意由_________所在地上海市浦东新区人民法院进行管辖。。
      </p>

      <div class="section-title">第八条 其他</div>
      <p>
        8.1
        除本协议另有约定外，在履行本协议过程中的一切通知，_________可通过网页公告、电子邮件、系统通知、短信提醒、电话或其他合理方式向您送达，该等通知自发送之日视为送达。
      </p>

      <p>
        8.2
        _________有权根据业务需要不时地更新本协议条款，并在_________网站、小程序或以其他方式予以公布。如您不同意所修改的内容，请立即停止使用_________服务并书面通知_________。
      </p>

      <p>
        8.3
        本协议为线上电子签署，自您在“_________”或其他授权网站点击“提交”、“注册”、“同意”、“登录”或其他类似确认键时生效。至按照本协议约定终止或解除时为止。
      </p>
      <p>
        8.4
        本协议采用电子文本形式制成，您认可该签约形式的法律效力，不得以未签署书面协议为由主张本协议无效。
      </p>

      <div class="highlight">
        附件 1：所有园区主体公司名称
        <p>_________</p>
        （以下无正文）
      </div>

      <div class="sign-section">
        <p>平台运营方：_________</p>
        <p>平台发包需方：_________</p>
        <p>协议分包商：_________</p>
        <p>证件号码：_________</p>
        <p>签订日期： __年 __月 __日</p>
      </div>

      <div style="margin-bottom: 100px;"></div>

      <div class="title">代开发票风险提示</div>
      <p>尊敬的纳税人：</p>
      <p>为切实保护您的合法权益，我们在为您提供优质服务的同时，温馨提示如下：</p>

      <p>
        一、您对本次提供的开票信息真实性、完整性和准确性承担法律责任。《中华人民共和国发票管理办法》第二十二条规定和个人不得有下列虚开发票行为：
      </p>

      <ul>
        <li>（一）为他人、为自己开具与实际经营业务情况不符的发票；</li>
        <li>（二）让他人为自己开具与实际经营业务情况不符的发票；</li>
        <li>（三）介绍他人开具与实际经营业务情况不符的发票。</li>
      </ul>

      <p>
        二、如果您是申请代开经营所得发票的其他个人，请及时到自然人电子税务局或办税服务厅自行申报缴纳个人所得税。
      </p>

      <p>三、您如果经常发生经营业务的，请自行申请办理税务登记。</p>

      <p> 四、税务机关会将您的开票信息列入重点风险核查范围，属于虚开的，分情形处理： </p>

      <ul>
        <li>
          1. 对于开票方，按照《中华人民共和国刑法》第二百零五条【虚开增值税专用发票、
          用于骗取出口退税、抵扣税款发票罪】虚开增值税专用发票或者虚开用于骗取出口退税、抵
          扣税款的其他发票的，处三年以下有期徒刑或者拘役，并处二万元以上二十万元以下罚金；
          虚开的税款数额较大或者有其他严重情节的，处三年以上十年以下有期徒刑，并处五万元以
          上五十万元以下罚金；虚开的税款数额巨大或者有其他特别严重情节的，处十年以上有期徒
          刑或者无期徒刑，并处五万元以上五十万元以下罚金或者没收财产。
        </li>
        <li>
          单位犯本条规定之罪的，对单位判处罚金，并对其直接负责的主管人员和其他直接责任
          人员，处三年以下有期徒刑或者拘役；虚开的税款数额较大或者有其他严重情节的，处三年
          以上十年以下有期徒刑；虚开的税款数额巨大或者有其他特别严重情节的，处十年以上有期
          徒刑或者无期徒刑。
        </li>
        <li>
          虚开增值税专用发票或者虚开用于骗取出口退税、抵扣税款的其他发票，是指有为他人
          虚开、为自己虚开、让他人为自己虚开、介绍他人虚开行为之一的。
        </li>
        <li>
          第二百零五条之一 【虚开发票罪】虚开本法第二百零五条规定以外的其他发票，情节
          严重的，处二年以下有期徒刑、拘役或者管制，并处罚金；情节特别严重的，处二年以上七
          年以下有期徒刑，并处罚金。
        </li>
        <li>
          单位犯前款罪的，对单位判处罚金，并对其直接负责的主管人员和其他直接责任人员，依照前款的规定处罚。
        </li>
        <li>2. 对于受票方，虚开的发票不得税前列支成本。</li>
        <li>3. 对于帮助虚开发票、偷逃税款的中介机构和人员进行联动检查。</li>
      </ul>

      <div class="sign-section">
        <p>
          <strong> 本人已阅读《代开发票风险提示》，知悉相关法律规定，愿意承担相关法律责任。</strong>
        </p>
        <p class="text_right">纳税人（签名）：_________</p>
        <p class="text_right">身份证号码：_________</p>
        <p class="text_right">__年 __月 __日</p>
        <p>
          <strong> 备注：自然人无法到场，经实名认证后委托他人代为申请的，经办人一并签名。</strong>
        </p>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    data() {
      return {};
    },
  };
</script>

<style lang="scss" scoped>
  .title {
    text-align: center;
    font-weight: bold;
    font-size: 18px;
    margin: 20px 0 40px 0;
  }
  .highlight {
    font-weight: bold;
  }
  .section-title {
    margin-top: 20px;
    font-weight: bold;
    font-size: 16px;
  }
  p {
    margin: 0 0 15px 0;
  }
  ul {
    margin: 10px 0;
    padding-left: 20px;
  }
  li {
    margin-bottom: 10px;
    list-style-type: none;
  }
  .text_right{
    text-align: right;
  }
  .sign-section {
    margin-top: 30px;
  }

  .u-vh-100 {
    height: 100vh;
  }
  .scroll-y {
    overflow-x: hidden;
    overflow-y: auto;
  }
  .u-bg-f {
    background-color: #fff;
  }
  .u-border-radius {
    border-radius: 5px;
  }
  .divboxstyle {
    padding: 18px;
    font-size: 14px;
  }
  h2,
  h3,
  h4,
  h5 {
    font-weight: bold;
    color: rgb(77, 68, 68);
  }
  h2 {
    font-size: 20px;
    line-height: 36px;
  }
  h3 {
    font-size: 18px;
    line-height: 36px;
  }
  h4 {
    font-size: 16px;
    line-height: 32px;
  }
  h5 {
    font-size: 14px;
    line-height: 20px;
  }
  .l {
    flex: 0 0 auto;
    width: 2em;
  }
  view {
    line-height: 20px;
    font-size: 14px;
  }
  .r,
  .l,
  .right-text {
    color: #666;
  }
  .right-text {
    text-indent: 2em;
  }
  .head-right-text {
    text-indent: 2em;
  }

  .bold {
    font-weight: bold;
  }
  .underline {
    font: oblique !important;
    text-decoration: underline;
  }
  .italic {
    font-style: italic;
  }
</style>
