<template>
    <view class="u-vh-100 u-p-b">
      <view class="u-h-100 scroll-y u-bg-f u-p-36 u-font-28">
        <view>尊敬的欢乐创小程序用户:</view>
        <u-gap height="10"></u-gap>
        <view>欢迎您使用欢乐创小程序付费服务。本协议是您（个人或单一实体）与重庆推小果传媒科技有限公司（以下统称为“推小果”）所提供的欢乐创小程序付费服务的法律协议（以下简称“本协议”）本协议服务条款构成您（无论是个人或单一实体）使用欢乐创小程序所提供服务之先决条件。本协议所指欢乐创小程序付费服务包括欢乐创小程序付费购买。<span class="u-font-bold">在开始购买之前，请您认真阅读本协议。如审阅不接受本协议，您应不使用或主动取消欢乐创小程序相应服务。如您继续使用，将被视为您已接受本协议全部条款，包括接受欢乐创小程序在法律允许范围内对本协议所做的所有修改。未成年人应在法定监护人陪同下审阅和履行，未成年人行使和履行本协议项下的权利和义务视为已获得了法定监护人的认可。</span></view>
        <u-gap height="10"></u-gap>
  
        
        <h2 class="u-font-bold">一、协议条款的确认和接受</h2>
        <u-gap height="10"></u-gap>
  
        <view>1.1、欢乐创小程序所提供的付费视频点播服务（以下统称为“付费服务”）将按照其服务条款和操作规则严格执行。您在享受欢乐创小程序付费服务（以下统称为“付费服务”）任何单项服务时，应受本协议以及单项软件及服务相关的用户协议的约束。</view>
        <view>1.2、付费服务的所有权和运营权，以及付费服务的规则、制度和活动的解释权均归欢乐创小程序所有。欢乐创小程序根据自身业务及中华人民共和国有关法律、法规的变化，不断完善付费服务相关付费并依此修正本协议。<span class="u-font-bold">欢乐创小程序有权就本协议随时更新，且毋须另行通知。您的权利和义务，均以最新的服务条款为准。如您在条款变更后继续使用欢乐创小程序相应服务，则视为已接受欢乐创小程序对本协议的修改。</span>欢乐创小程序享有对服务用户的网上一切相应活动的检查的权利，如您的行为违反有关法律法规或违反本服务条款的约定，欢乐创小程序享有终止服务及追究您责任等权利。</view>
        <view>1.3、您在进行注册程序及缴费程序过程中点击进一步操作的按钮即表示您已仔细阅读并完全接受本收费协议下的全部条款。只有您根据提示确认愿意支付相关费用并支付相关费用后，您才能使用该付费服务内容。如您拒绝支付该等费用，则不能使用相关的服务。</view>
        <view></view>
        <view><span class="u-font-bold"></span></view>
        <view class="u-font-bold"></view>
        <u-gap height="10"></u-gap>
  
  
        <h2 class="u-font-bold">二、付费服务内容及范围</h2>
        <u-gap height="10"></u-gap>
  
				<view>2.1、当您购买了欢乐创小程序付费服务内容，即视为您认可该项服务标明的价格，具体收费标准以您发起订单时页面中标价为准。</view>
        <view>2.2、每一个付费服务都有自己单独的服务周期，当您购买具体付费服务内容时即视为认可它的服务周期，<span class="u-font-bold">请在服务周期内行使您的相应权利。</span>服务周期不会因使用方式的差异而延长或缩短。服务周期会在您发起订单时页面中标注说明。</view>
				<view>2.3、当您购买完成时，欢乐创小程序将即时收取相应费用，该项服务即时按照约定有效期生效，无论任何原因（包括放弃使用服务内容）均不提供退费服务。</view>
        <u-gap height="10"></u-gap>
  
  
        <h2 class="u-font-bold">三、网络服务内容的所有权声明</h2>
        <u-gap height="10"></u-gap>

        <view>3.1、对于您购买所使用的欢乐创小程序账号（含第三方授权欢乐创小程序登录的账号），<span class="u-font-bold">您只可以私人使用，不得转借或转让他人，不得以商业、盈利、非法的方式或目的进行使用。</span></view>
				<view>3.2、您同意不会采用收费或免费的方式，全部或部分地在任何公开场合展示您购买的收费服务，除非您的上述行为不会构成侵权。</view>
				<view>3.3、您同意不会主动对欢乐创小程序用于保护其收费服务的任何安全措施技术进行攻克、反向操作、更改、破坏或其他篡改，或协助他人进行上述行为。</view>
				<view>3.4、您同意不会进行其他违反本协议或法律法规规定的禁止行为。</view>
        <u-gap height="10"></u-gap>
  
  
        <h2 class="u-font-bold">四、用户的权利责任与义务</h2>
        <u-gap height="10"></u-gap>
  
        <view class="u-font-bold">4.1、您须对您自身在使用欢乐创小程序付费服务所提供的服务时的一切行为、行动（不论是否故意）负全部责任。</view>
        <view>4.2、您应自行负责妥善且正确地保管、使用、维护其在欢乐创小程序申请取得的账户及账户密码。您应对其账户密码采取必要和有效的保密措施。<span class="u-font-bold">非欢乐创小程序原因致使您账户密码泄漏以及因您保管、使用、维护不当造成损失的，欢乐创小程序无须承担与此有关的任何责任。</span></view>
        <view>4.3、您明确了解并同意欢乐创小程序所提供给您的支付方式，您通过此种支付方式支付可能存在一定的商业风险（包括但不限于不法分子利用您账户或银行卡等有价卡等进行违法活动），该等风险均会给您造成相应的经济损失。<span class="u-font-bold">为此，您同意欢乐创小程序在充分履行其在本协议项下全部义务及勤勉谨慎义务的前提下不对您的前述风险和损失承担任何责任；并且，欢乐创小程序不承担向不法分子追究侵权责任或者代其向您承担损失的任何责任和义务。</span></view>
				<view>4.4、当服务需要时，您须提供真实有效的身份或资料信息，如果您提供的资料包含有不正确的信息，欢乐创小程序保留结束对您继续服务的权利。</view>
				<view>4.5、若您发现有非法使用欢乐创小程序用户帐号、付费服务内容或安全漏洞的情况时，请立即告知欢乐创小程序或向公安机关报案。</view>
				<view>4.6、您在使用欢乐创小程序付费服务时必须符合中华人民共和国有关法律法规。</view>
        <u-gap height="10"></u-gap>
  
  
        <h2 class="u-font-bold">五、未成年人保护声明</h2>
        <u-gap height="10"></u-gap>
  
				<view>5.1、未成年人指中华人民共和国规定的未满18周岁的中华人民共和国公民，未成年人应在其监护人指导和监督下上网、从事健康有益的网络行为。</view>
				<view>5.2、未成年人参加网上活动应事先得到家长或其法定监护人（以下统称为"监护人"）的可经查证的同意，其监护人应对被监护人的一切行为、行动（不论是否故意）负责。</view>
				<view>5.3、监护人应承担保护未成年人在网络环境下的隐私权的首要责任。</view>
        <u-gap height="10"></u-gap>
  
        
        <h2 class="u-font-bold">六、免责声明</h2>
        <u-gap height="10"></u-gap>
  
        <view class="u-font-bold">6.1、鉴于网络服务的特殊性，您同意欢乐创小程序对付费服务的内容及范围，有权随时修改而不需通知用户，对于任何因服务调整或用户与欢乐创小程序之间任何一方根据实际情况而造成的服务内容的中断或终止而造成的任何损失，欢乐创小程序均无需对您或任何第三方承担任何责任。</view>
				<view>6.2、用户对条款修改有异议，或对欢乐创小程序的服务不满，可以停止使用欢乐创小程序的网络服务或通告欢乐创小程序停止对该用户的服务。结束用户服务后，用户使用网络服务的权利即时终止。终止后，欢乐创小程序无义务传输和提供任何未处理的信息或未完成的服务给用户或第三方。</view>
        <view class="u-font-bold">6.3、对于因服务器的死机、网络的故障、数据库故障、软件升级、服务器维修、调整、升级等问题，或其他不可抗拒的事由，包括但不限于政府行为、自然灾害、黑客攻击等造成的服务中断和对您个人数据及资料造成的损失，欢乐创小程序不承担由此对您造成的任何损失或退还任何已缴纳的收费服务费用。</view>
        <view class="u-font-bold">6.4、您购买的服务使用期限中包含解决故障、服务器维修、调整、升级等所需用的合理时间，欢乐创小程序对任何直接、间接、偶然、特殊及继起的损害不负责任，不予赔偿并保留解释权。</view>
        <view class="u-font-bold">6.5、您在使用欢乐创小程序所提供的服务时，如遭受任何人身或财务的损失、损害或伤害，不论原因如何，欢乐创小程序均不负责任。由于您将个人密码告知他人或与他人共享注册帐户，由此导致的任何个人资料泄露，本小程序不负任何责任。</view>
				<view>6.6、如您违反本服务条款中的内容，欢乐创小程序有权在不通知您的情况下立即终止您已购买的所有服务，以及取消您的欢乐创小程序账户和使用权限，但不退还任何已缴纳的收费服务费用。</view>
				<view>6.7、如因不可抗力或其它欢乐创小程序无法控制的原因使本站销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，用户同意不要求欢乐创小程序赔偿，但欢乐创小程序承诺尽可能合理地协助处理善后事宜。</view>
				<view>6.8、如发生本站服务条款与中国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它合法条款则依旧保持对用户产生法律效力和影响。</view>
				<view>6.9、本协议的规定是可分割的，如本协议任何规定被裁定为无效或不可执行，该规定可被删除而其余条款应予以执行。</view>
        <u-gap height="10"></u-gap>
  
  
        <h2 class="u-font-bold">七、法律适用及管辖</h2>
        <u-gap height="10"></u-gap>
  
				<view>7.1、本服务条款的解释，效力及纠纷的解决，适用于中华人民共和国大陆地区法律。</view>
				<view>7.2、如双方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向武汉推小果在线技术有限公司所在地的人民法院提起诉讼。欢乐创小程序拥有对以上各项条款内容的解释权和修改权，同时北京推小果在线技术有限公司保留在未经通知的情况下不时地修改本版本的权利归欢乐创小程序版权所有</view>
				<!-- <view></view>
        <view><span class="u-font-bold"></span></view>
        <view class="u-font-bold"></view> -->
        <u-gap height="10"></u-gap>
      </view>
    </view>
  </template>
  
  <style lang="scss" scoped>
  .text-indent {
    text-indent: 2em;
  }</style>
  