<template>
  <view class="u-vh-100 u-p-b">
    <view class="u-h-100 scroll-y u-bg-f u-p-36 u-font-28">
      <view>《欢乐创小程序隐私权保护政策》 </view>
      <u-gap height="10"></u-gap>
      <view>重庆推小果传媒科技有限公司（以下简称“推小果”、“我们”）是欢乐创小程序（以下简称“小程序”）的技术提供方，我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。本隐私权保护政策阐述了欢乐创小程序将如何收集、使用您的个人信息，并帮助您了解您的权利，请在使用我们的服务前，仔细阅读并了解本隐私权保护政策。</view>
      <u-gap height="10"></u-gap>
      <view class="u-font-bold">【特别提示】请仔细阅读本《隐私权保护政策》（尤其是加粗、划线的内容）并确定了解我们对您个人信息的处理规则。阅读、使用欢乐创小程序过程中，如您有任何疑问，可联系我们的客服咨询，如您不同意本隐私权保护政策中的任何条款，您应立即停止访问和使用。</view>
      <u-gap height="10"></u-gap>
      <view>本隐私权保护政策将帮助您了解以下内容：</view>
      <u-gap height="10"></u-gap>
      <view class="u-font-bold">一、定义</view>
      <view class="u-font-bold">二、我们如何收集和使用您的个人信息</view>
      <view class="u-font-bold">三、我们如何使用Cookie和同类技术</view>
      <view class="u-font-bold">四、我们如何共享、转让、公开披露您的个人信息</view>
      <view class="u-font-bold">五、您对个人信息享有的控制权</view>
      <view class="u-font-bold">六、我们如何保护和保存您的个人信息</view>
      <view class="u-font-bold">七、未成年人的保护</view>
      <view class="u-font-bold">八、本隐私权保护政策如何更新</view>
      <view class="u-font-bold">九、适用范围</view>
      <view class="u-font-bold">十、如何联系我们</view>
      <u-gap height="10"></u-gap>

      
      <h2 class="u-font-bold">一、定义</h2>
      <u-gap height="10"></u-gap>

      <view><span class="u-font-bold">个人信息：</span>指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。本隐私权保护政策所指个人信息请见“我们如何收集和使用您的个人信息”这一条款中的所一一列明的类型。</view>
      <view><span class="u-font-bold">个人敏感信息：</span>指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私权保护政策中涉及的个人敏感信息包括：个人播放记录（保存最近30天内）。</view>
      <view>订购与支付：您使用本产品时，订购分集付费服务时产生的记录，包括订购记录、消费记录，这些会信息会存储于我们的服务器中。以上信息为软件功能的必须的信息，如您不同意我们记录前述信息，我们将无法为您提供视频购买和视频观看服务。</view>
      <view class="u-font-bold">对于本隐私权保护政策中列示的如上个人敏感信息，为便于您在阅读时有所警觉，我们除在此统一定义并列示外，另仍然会在本隐私权保护政策中以字体加粗、加下划线，或单独指出等突出显示的方式再行提示您注意。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">二、我们如何收集和使用您的个人信息</h2>
      <u-gap height="10"></u-gap>

      <view>我们仅会出于本隐私权保护政策所述的以下目的，收集和使用您的个人信息：</view>
      <view class="u-font-bold">1、为您提供付费虚拟货币及购买付费内容服务</view>
      <view>当您通过欢乐创小程序购买虚拟内容（例如付费点播）时，我们将会收集您的<span class="u-font-bold">付费金额、付费数量、付费时间、付费订单编号、付费状态</span>以为您提供付费信息及权益的记录、展示。</view>
      <view>2、为您提供安全保障</view>
      <view>为提高您使用我们服务的安全性，保护您、其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或欢乐创小程序平台协议规则的情况，<span class="u-text-decoration">我们可能使用或整合您的注册信息、网络日志来综合判断流量异常、多端登录等情况，并依法采取必要的记录、审计、分析、处置措施。例如我们会综合分析用户账号活动异常、多端登录、流量异常等，以保护您的账号安全。</span></view>
      <view class="u-font-bold">3、其他目的及用途</view>
      <view>在符合如下情形时，我们会根据法律法规的规定，另行事先征求您的同意：</view>
      <view>1）我们将信息用于本隐私权保护政策未载明的其他使用目的、用途；</view>
      <view>2）我们将基于特定使用目的收集而来的信息用于其他使用目的。</view>
      <view class="u-font-bold">4、征得授权同意的例外</view>
      <view>根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：</view>
      <view>1）与国家安全、国防安全有关的；</view>
      <view>2）与公共安全、公共卫生、重大公共利益有关的；</view>
      <view>3）与犯罪侦查、起诉、审判和判决执行等有关的；</view>
      <view>4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；</view>
      <view>5）所收集的个人信息是您自行向社会公众公开的；</view>
      <view>6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；</view>
      <view>7）根据您的要求签订合同所必需的；</view>
      <view>8）用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；</view>
      <view>9）为合法的新闻报道所必需的；</view>
      <view>10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；</view>
      <view>11）法律法规规定的其他情形。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">三、我们如何使用Cookie和同类技术</h2>
      <u-gap height="10"></u-gap>

      <view>（一）关于Cookie和同类技术</view>
      <view>Cookie是包含字符串的小文件，在您登入和使用小程序时发送、存放在您的移动设备（通常经过加密）。Cookie同类技术是可用于与Cookie类似用途的其他技术。</view>
      <view>目前，我们主要使用Cookie收集您的个人信息。您知悉并同意，随着技术的发展和我们产品和服务的进一步完善，我们也可能会使用Cookie同类技术。</view>
      <view>（二）我们如何使用Cookie和同类技术</view>
      <view>在您使用我们的产品与/或服务时，我们可能会使用Cookie和同类技术收集您的一些个人信息，您的个人登录信息，网站访问记录，Cookie和同类技术收集该类信息是为了您使用我们的产品与/或服务的必要、简化您重复操作的步骤（如注册、登录）、便于您查看使用历史（如视频观看历史）、向您提供更切合您个人需要的服务内容和您可能更感兴趣的内容、保护您的信息和账号安全性、改善我们的产品和服务等。我们承诺仅在本《欢乐创小程序隐私权保护政策》所述目的范围内使用Cookie和同类技术。</view>
      <view>如果您的小程序平台允许，您可以通过您的小程序平台（抖音、快手等）的设置以管理、（部分/全部）拒绝Cookie与/或同类技术；或删除已经储存在您的移动设备内的Cookie与/或同类技术，从而实现我们无法全部或部分追踪您的个人信息。您如需详细了解如何更改小程序平台设置，请具体查看您使用的小程序平台的相关设置页面。您理解并知悉：我们的某些产品/服务只能通过使用Cookie或同类技术才可得到实现，如您拒绝使用或删除的，您可能将无法正常使用我们的相关产品与/或服务或无法通过我们的产品与/或服务获得最佳的服务体验，同时也可能会对您的信息保护和账号安全性造成一定的影响。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">四、我们如何共享、转让、公开披露您的个人信息</h2>
      <u-gap height="10"></u-gap>

      <view>1、共享和披露</view>
      <view>我们不会将您的个人信息与第三方公司、组织和个人共享，但以下情况除外：</view>
      <view class="u-font-bold">1）在获得您（以及监护人）的明确同意或授权或您主动选择的情况下共享。</view>
      <view><span class="u-font-bold">2）在法定情形下的共享。</span>我们可能会根据法律法规规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。例如如果我们确定您出现违反法律法规或严重违反欢乐创小程序平台相关协议规则的情况，或为保护我们及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或平台相关协议规则披露关于您的个人信息，包括相关违规行为以及欢乐创小程序已对您采取的措施。例如，若您违反我方平台规则、触犯法律法规和/或违背公序良俗，造成重大社会影响，给我方平台造成声誉损失，我们可能会公开披露您的信息与处罚情况。</view>
      <view>3）向<span class="u-font-bold">小程序其它运营方共享您的个人信息。鉴于小程序运营、维护服务将由我们委托的第三方提供，您理解并同意，</span>为确保您充分享受小程序项下的此类情况下，我们只会共享必要的个人信息，且受本隐私权保护政策中所声明目的的约束。我们的关联方如要改变个人信息的处理目的，将再次征求您的授权同意。</view>
      <view>4）与合作伙伴共享：<span class="u-font-bold">欢乐创小程序的某些服务将由我们和委托的合作伙伴共同提供。我们可能会向合作伙伴提供您的某些个人信息，以为您提供全面、完整、流畅的服务和产品体验。</span>共享的个人信息均是匿名化或去标识化处理后的无法识别或关联到您的信息，且共享第三方无法重新识别此类信息的自然人主体。例如，在您通过欢乐创小程序付费时，我们需要将您在小程序内的付费信息提供给合作伙伴，供其为您展示付费记录等等服务。我们仅会出于合法、正当、必要、特定、明确的目的提供您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于与产品或服务无关的其他用途。我们会与共享的对象签署严格的数据保护协议，要求他们按照我们的说明、本隐私权保护政策以及其他任何相关的保密和安全措施来处理个人信息。如果我们共享您的个人敏感信息或授权合作伙伴改变个人信息的使用及处理目的，将再次征求您的授权同意。</view>
      <view>2、转让</view>
      <view>我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：</view>
      <view>1）在获得明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；</view>
      <view>2）在欢乐创小程序运营主体发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本隐私权保护政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。</view>
      <view>3、公开披露</view>
      <view>我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会公开披露您的个人信息：</view>
      <view class="u-font-bold">1）根据您的需求，在您明确同意的披露方式下披露您所指定的个人信息；</view>
      <view class="u-font-bold">2）根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您个人信息的情况下，我们可能会依据所要求的个人信息类型和披露方式公开披露您的个人信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都将进行慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。</view>
      <view>4、共享、转让、披露个人信息时事先征得授权同意的例外</view>
      <view>根据相关法律法规的规定，在以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：</view>
      <view>1）与国家安全、国防安全直接相关的；</view>
      <view>2）与公共安全、公共卫生、重大公共利益直接相关的；</view>
      <view>3）与犯罪侦查、起诉、审判和判决执行等有关的；</view>
      <view>4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</view>
      <view>5）所收集的个人信息是个人信息主体自行向社会公众公开的；</view>
      <view>6）其他法律法规等规定的情形。</view>
      <view>根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">五、您对个人信息享有的控制权</h2>
      <u-gap height="10"></u-gap>

      <view>1、访问、查看您的个人信息</view>
      <view>当您完成欢乐创小程序登录后，您有权通过以下方式自行访问您的个人信息：</view>
      <view>1）账号信息。您在小程序中可以随时查看您的账号名称、头像、等账户信息。</view>
      <view>2）财产性权益信息。您可以点击“我的”查看您的观看记录、我的追剧、已购买的内容等财产性权益信息。</view>
      <view>2、删除个人信息</view>
      <view>一般而言，我们只会在法律法规规定或必需且最短的时间内保存您的个人信息。</view>
      <view>在以下情形中，您可以向我们提出删除个人信息的请求：</view>
      <view>1）如果我们处理个人信息的行为违反法律法规；</view>
      <view>2）如果我们收集、使用您的个人信息，却未征得您的同意；</view>
      <view>3）如果我们处理个人信息的行为违反了与您的约定；</view>
      <view>4）如果您注销了账户；</view>
      <view>5）如果我们终止服务及运营。</view>
      <view>您可通过<span class="u-font-bold">小程序客服</span>联系我们获得帮助，<span class="u-font-bold">若我们决定响应您的删除请求，</span>我们即会对此类信息进行删除或匿名化处理，除非法律法规另有规定，<span class="u-font-bold">我们还将同时通知从我们获得或独立获得您的个人信息的其它运营方，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。当您从我们的服务中删除信息后，我们可能不会立即从备份系统中删除相应的信息，但会在备份更新时删除这些信息。</span></view>
      <view>3、您的其它权利</view>
      <view>管理、撤回您的授权同意、复制、更正账号信息、注销账号个人信息。</view>
      <view>除了维持本服务正常运营所必需提供的信息外，如您希望撤回关于同意运营方处理您的个人信息的意思表示、请求复制或更正账户中的个人信息或希望注销您的账号的，您可通过<span class="u-font-bold">【wenchengjie@bjjiayin.cn】</span>联系我们获得帮助，我们特别提示您，您撤回同意的并不影响基于您同意已经进行的个人信息处理活动的效力；您注销账号的行为是不可逆的行为，一旦您注销您的账号，我们将停止为您提供产品或服务，并对您的个人信息进行册除或匿名化处理，但法律法规另有规定的除外。</view>
      <view>4、投诉举报及响应</view>
      <view>当您有其他的投诉、建议或相关问题时，请通过投诉举报邮箱<span class="u-font-bold">【wenchengjie@bjjiayin.cn】</span>与我们联系。我们将尽快审核所涉问题，并在验证您的用户身份后及时予以回复，对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份数据库中存放的信息）的请求，我们可能会予以拒绝。在以下情形中，我们将无法响应您的请求：</view>
      <view>（1）与个人信息控制者履行法律法规规定的义务相关的；</view>
      <view>（2）与国家安全、国防安全直接相关的；</view>
      <view>（3）与公共安全、公共卫生、重大公共利益直接相关的；</view>
      <view>（4）与刑事侦查、起诉、审判和执行判决等直接相关的；</view>
      <view>（5）个人信息控制者有充分证据表明个人信息主体存在主观恶意或滥用权利的；</view>
      <view>（6）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</view>
      <view>（7）响应个人信息主体的请求将导致个人信息主体或其他个人、组织的合法权益受到严重损害的，涉及商业秘密的。</view>
      <view><span class="u-font-bold">一般情况下，我们将在 48 小时内回复您的问题。</span>当然，如您不满意，您也可以通过向主管机关提出投诉举报。</view>
      <view>5、访问隐私权保护政策</view>
      <view class="u-font-bold">您可以在小程序【我的】页面随时查看本隐私权保护政策的全部内容。</view>
      <view>6、有权获得停止运营的告知</view>
      <view>如果欢乐创小程序终止服务或运营，我们将及时停止收集您个人信息的活动，并且会至少提前三十日将停止运营的通知以逐一送达或公告的形式通知您，并在终止服务或运营后对所持有的您的个人信息进行删除或匿名化处理。</view>
      <u-gap height="10"></u-gap>

      
      <h2 class="u-font-bold">六、我们如何保护和保存您的个人信息</h2>
      <u-gap height="10"></u-gap>

      <view>1、技术保护：</view>
      <view>为保障您的信息安全，我们努力采取各种符合业界标准的合理的物理、电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于 SSL、信息加密存储、数据中心的访问控制。我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息。</view>
      <view>2、安全体系保证：</view>
      <view>我们有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术、个人信息安全影响评估等方面多维度提升整个系统的安全性。目前，我们已经通过信息安全等级保护三级认证。</view>
      <view>3、人员安全管理：</view>
      <view>我们对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。我方会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，我方将尽力做到使您的信息不被泄漏、毁损或丢失。我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。我们将会要求其它运营方采取安全保障程度不低于我方的上述措施以更好保障您的个人信息安全。</view>
      <view>4、敏感信息及密码保护提示：</view>
      <view>1）个人敏感信息保护注意：您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息，例如您的小程序账户ID、账户余额、付费记录、购买短剧的订单编号等。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。</view>
      <view class="u-font-bold">2）信息披露提示及泄露处理：请注意互联网并非绝对安全的环境。在使用我方平台某些服务时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是您的账户发生泄露，请您立即在【快手app搜索账号「欢乐创」并发送私信联系我们】，以便我方采取相应措施。</view>
      <view>5、信息安全事件处理</view>
      <view>在不幸发生个人信息安全事件后，我们将按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。</view>
      <view>6、我们如何保存您的个人信息：</view>
      <view>1）存储地点：欢乐创小程序会按照法律法规的规定，将在境内运营过程中收集和产生的个人信息存储于中华人民共和国境内，且不会将该等信息向境外进行传输。如欢乐创小程序因业务发展需要，需向境外进行传输的，将明确告知并征得您的同意。</view>
      <view>2）存储期限：我们会采取合理可行的措施避免收集无关的个人信息。我们只会在达成本隐私权保护政策所述目的所需的最短期限内保留您的个人信息，除非您同意延长保留期或受到法律的允许。超出保存期限后，欢乐创小程序将删除您的个人信息或采取技术措施进行匿名化处理，但法律法规另有规定的除外。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">七、未成年人的保护</h2>
      <u-gap height="10"></u-gap>

      <view class="u-font-bold">我们重视未成年人的个人信息保护，在您使用我们的服务过程中，我们推定您具有相应的民事行为能力。如您为未成年人，在您使用欢乐创小程序相关服务之前，您应在您的父母或者其他监护人的监护、指导下仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下向我们提供信息。</view>
      <view>对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。<span class="u-font-bold">如果我们发现在未事先获得可证实的父母或监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关信息。</span></view>
      <u-gap height="10"></u-gap>

      <h2 class="u-font-bold">八、本隐私权保护政策如何更新</h2>
      <u-gap height="10"></u-gap>

      <view>我们鼓励您在每次使用我们的产品或服务时都查阅我们的《欢乐创小程序隐私权保护政策》。为了给您提供更好的服务，我们可能随时更新本《欢乐创小程序隐私权保护政策》的条款，该等更新构成本《欢乐创小程序隐私政策》的一部分。如该等更新造成您在本《欢乐创小程序隐私权保护政策》下权利的实质减少或重大变更，我们将在本政策生效前通过在主页上显著位置提示或向您推送消息或以其他方式通知您，让您在选择继续使用我们的产品与/或服务之前可以及时查看修订后的隐私政策。因此，为了您能及时接收到通知，建议您在联系方式更新时及时通知我们。在政策更新的情况下，若您继续使用我们的服务，即表示您充分阅读、理解并同意受经修订的本《欢乐创小程序隐私权保护政策》的约束。如您在本政策更新生效后继续使用我们的服务，即表示您已充分阅读、理解并接受更新后的文本并愿意受更新后的文本约束。</view>
      <view>上述的“重大变更”包括但不限于：</view>
      <view>我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息的类型、个人信息的使用方式等；</view>
      <view>我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有变更等；</view>
      <view>个人信息共享、转让或公开披露的主要对象发生变化；</view>
      <view>您参与个人信息处理方面的权利及其行使方式发生重大变化；</view>
      <view>我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；</view>
      <view>个人信息安全影响评估报告表明存在高风险时；</view>
      <view>其他重要的或可能严重影响您的个人权益的情况发生时。</view>
      <u-gap height="10"></u-gap>
      

      <h2 class="u-font-bold">九、适用范围</h2>
      <u-gap height="10"></u-gap>

      <view>本隐私权保护政策仅适用于由我们及其其他运营方提供的所有服务，不适用于有单独的隐私权保护政策且未纳入本隐私权保护政策的第三方产品或服务。</view>
      <view class="u-font-bold">本隐私权保护政策不适用于我们服务中链接到其他第三方产品或服务，您使用这些第三方服务（如涉及，包括您向这些第三方提供的任何个人信息），将受这些第三方的服务条款及隐私权保护政策约束（而非本隐私权保护政策），具体规定请您仔细阅读第三方的条款。请您妥善保护自己的个人信息，仅在必要的情况下向第三方提供。</view>
      <view></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十、如何联系我们</h2>
      <u-gap height="10"></u-gap>

      <view class="u-font-bold">如果您对本隐私权保护政策、个人信息安全及未成年人个人信息保护相关事宜有任何疑问、投诉、意见或建议，您可以通过wenchengjie@bjjiayin.cn与我们联系，我们有专门人员负责对接.</view>
      <u-gap height="10"></u-gap>



    </view>
  </view>
</template>

<style lang="scss" scoped>
.text-indent {
  text-indent: 2em;
}</style>
