<template>
  <view class="u-vh-100 u-p-b">
    <view class="u-h-100 scroll-y u-bg-f u-p-36 u-font-28">
      <view>欢乐创小程序-服务条款</view>
      <u-gap height="10"></u-gap>
      <view></view>
      <h2 class="u-font-bold">一、服务条款的确认和接纳</h2>
      <u-gap height="10"></u-gap>

      <view>欢乐创小程序及其涉及到的产品、相关软件的所有权和运作权归重庆推小果传媒科技有限公司（以下简称推小果）所有，推小果公司享有对推小果产品一切活动的监督、提示、检查、纠正及处罚等权利。用户通过购买程序阅读本服务条款并"同意"完成购买，即表示用户与推小果公司已达成协议，自愿接受本服务条款的所有内容。如果用户不同意服务条款的条件，则不能获得使用推小果服务以及成为推小果用户的权利。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">二、服务保护条款</h2>
      <u-gap height="10"></u-gap>

      <view>1、 推小果公司运用自己的基础设施通过国际互联网络为用户提供各项服务，用户必须：</view>
      <view>（1）提供设备，包括个人手机一台、上网装置及其他设备。</view>
      <view>（2）个人上网和支付与此服务有关的费用。</view>
      <view>2、考虑到推小果公司产品服务的重要性，用户同意：</view>
      <view>（1）提供及时、详尽及准确的个人资料。</view>
      <view>（2）不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。</view>
      <view>3、用户可授权推小果公司向第三方透露其注册资料，否则推小果公司不能公开用户的姓名、住址、电子邮箱、帐号。除非：</view>
      <view>（1）事先获得用户明确授权后，用户要求推小果公司或授权某人通过电子邮件服务或其他方式透露这些信息。</view>
      <view>（2）相应的法律、法规要求以及按照有关政府主管部门的要求，需要推小果公司提供用户的个人资料。</view>
      <view>（3）推小果发现用户违反了本站服务条款或本站其它使用规定。</view>
      <view>（4）为了维护公众以及推小果公司合法利益。</view>
      <view>（5）推小果公司可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与推小果公司同等的保护用户隐私的责任，则推小果公司有权将用户的注册资料等提供给该第三方。</view>
      <view>（6）在不透露单个用户隐私资料的前提下，推小果公司有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</view>
      <view>
        4、如果用户提供的资料不准确，不真实，不合法有效，推小果公司保留结束用户使用推小果公司各项服务的权利。
        <br/>
        用户在享用推小果公司各项服务的同时，同意接受推小果公司提供的各类信息服务。
      </view>
      <view>5、推小果公司定义的信息内容包括：文字、软件、声音、相片、录像、图表；在广告中的全部内容；推小果公司为用户提供的商业信息等，所有这些内容受版权、商标权、和其它知识产权及所有权法律的保护。所以，用户只能在推小果公司授权下才能使用这些内容，而不能擅自复制、修改、编撰这些内容、或创造与内容有关的衍生产品。</view>
      <view>6、如果用户未遵守本服务条款的任何一项，推小果公司有权利即终止提供一切服务，并保留通过法律手段追究责任的权利。</view>
      <view class="u-font-bold">7、使用推小果公司提供的服务由用户自己承担风险，在适用法律允许的最大范围内，推小果公司在任何情况下不就因使用或不能使用推小果公司提供的服务所发生的特殊的、意外的、直接或间接的损失承担赔偿责任。即使已事先被告知该损害发生的可能性。</view>
      <view>8、用户须明白，使用推小果公司提供的服务涉及到Internet服务和电信增值服务，可能会受到各个环节不稳定因素的影响。因此服务存在因不可抗力、计算机病毒或黑客攻击、国家相关行业主管部门及电信运营商的调整、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。<span class="u-font-bold">用户须承担以上风险，推小果公司不作担保。对因此导致用户不能发送、上传和接受阅读消息、或接发错消息，或无法实现其他通讯条件，推小果公司不承担任何责任。</span></view>
      <view class="u-font-bold">9、用户须明白，在使用推小果公司提供的服务存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，推小果公司和合作公司对服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适用性、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">三、用户使用规则</h2>
      <u-gap height="10"></u-gap>

      <view>特别提示用户，使用互联网必须遵守国家有关的政策和法律，包括但不限於刑法、国家安全法、保密法、计算机信息系统安全保护条例等，保护国家利益，保护国家安全，对于违法使用互联网络而引起的一切责任，由用户负全部责任。</view>
      <view>1、用户在申请使用推小果公司提供的网络服务时，必须向推小果公司提供准确的个人资料，如个人资料有任何变动，必须及时更新。</view>
      <view>2、用户注册成功后，推小果公司将给予每个用户一个用户帐号，该用户帐号由用户负责保管；<span class="u-font-bold">用户应当对以其用户帐号进行的所有活动和事件负法律责任。帐号相关信息不得影射或者含有不雅含义，对违反者将予以删除帐号</span></view>
      <view><span class="u-font-bold">3、用户不得使用推小果公司服务发送或传播敏感信息和违反国家法律制度的信息，否则推小果公司保留随时删除用户帐号的权利。</span>这些信息包括但不限于下列信息：</view>
      <view>（a）反对宪法所确定的基本原则的；</view>
      <view>（b）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</view>
      <view>（c）损害国家荣誉和利益的；</view>
      <view>（d）煽动民族仇恨、民族歧视，破坏民族团结的；</view>
      <view>（e）破坏国家宗教政策，宣扬邪教和封建迷信的；</view>
      <view>（f）散布谣言，扰乱社会秩序，破坏社会稳定的；</view>
      <view>（g）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</view>
      <view>（h）侮辱或者诽谤他人，侵害他人合法权益的；</view>
      <view>（i）含有法律、行政法规禁止的其他内容的。</view>
      <view>4、用户在使用推小果公司网络服务过程中，必须遵循以下原则：</view>
      <view>（a）遵守中国有关的法律和法规；</view>
      <view>（b）不得为任何非法目的而使用网络服务系统；</view>
      <view>（c）遵守所有与网络服务有关的网络协议、规定和程序；</view>
      <view>（d）不得利用推小果公司网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；</view>
      <view>（e）不得利用推小果公司络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料，不得对他人进行人身攻击。</view>
      <view>（f）不得利用推小果公司络服务系统进行任何不利于推小果公司的行为。</view>
      <view>5、使用推小果公司小程序服务，用户应加强个人资料的保护意识，并注意个人密码的密码保护。</view>
      <view>6、盗取他人用户帐号或利用网络通讯骚扰他人，均属于非法行为。用户不得采用测试、欺骗等任何非法手段，盗取其他用户的帐号和对他人进行骚扰。</view>
      <view class="u-font-bold">7、用户须对自己在使用推小果公司的服务过程中的行为承担法律责任。用户承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在推小果公司首先承担了因用户行为导致的行政处罚或侵权损害赔偿责任后，用户应给予推小果公司等额的赔偿。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">四、服务条款的修改</h2>
      <u-gap height="10"></u-gap>

      <view>推小果会员服务协议以及小程序公告可由推小果公司随时更新，且无需另行通知。您在使用相关服务时,应关注并遵守其所适用的相关条款。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">五、服务修订</h2>
      <u-gap height="10"></u-gap>

      <view>推小果公司特别提示用户，推小果公司为了保障公司业务发展和调整的自主权，拥有随时修改或中断服务而不需通知用户的权利，推小果公司行使修改或中断服务的权利不需对用户或任何第三方负责。用户必须在同意本条款的前提下，推小果公司才开始对用户提供服务。除非本服务协议另有其它明示规定，推小果公司所推出的新产品、新功能、新服务，均受到本服务协议之规范。,应关注并遵守其所适用的相关条款。</view>
      <u-gap height="10"></u-gap>

      
      <h2 class="u-font-bold">六、用户隐私制度</h2>
      <u-gap height="10"></u-gap>

      <view>尊重用户个人隐私是推小果公司的一项基本政策。所以，作为对以上第二点个人注册资料分析的补充，推小果公司一定不会公开、编辑或透露用户的注册资料及保存在推小果公司各项服务中的非公开内容，除非推小果公司在诚信的基础上认为透露这些信息在以下几种情况是必要的：</view>
      <view>（1）遵守有关法律规定，包括在国家有关机关查询时，提供用户在推小果公司的网页上发布的信息内容及其发布时间、互联网地址或者域名以及其他用户上传至推小果公司的信息。</view>
      <view>（2）遵从推小果公司产品服务程序。</view>
      <view>（3）保持维护推小果公司的商标所有权。</view>
      <view>（4）在紧急情况下维护用户个人和社会大众的隐私安全。</view>
      <view>（5）推小果公司认为必要的其他情况下。</view>
      <view>用户在此授权推小果公司可以向其电子邮箱发送商业信息。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">七、用户的帐号和安全性</h2>
      <u-gap height="10"></u-gap>

      <view>用户一旦成功注册，将得到一个帐号。如果用户未保管好自己的帐号而对其自身、推小果公司或第三方造成的损害，用户将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。用户可以结束旧的帐户重开一个新帐户。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告推小果公司。</view>
      <u-gap height="10"></u-gap>

      <h2 class="u-font-bold">八、拒绝提供担保</h2>
      <u-gap height="10"></u-gap>

      <view class="u-font-bold">鉴于网络服务的特殊性，用户同意推小果公司有权不经事先通知，随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。推小果公司不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</view>
      <view>推小果公司需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成网络服务（包括收费网络服务）在合理时间内的中断，推小果公司无需为此承担任何责任。<span class="u-font-bold">推小果公司保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。</span></view>
      <view>用户理解并接受下载或通过推小果公司产品服务取得的任何信息资料取决于用户自己，并由其承担系统受损或资料丢失的所有风险和责任。</view>
      <view>本服务或第三人可提供与其它国际互联网上之小程序或资源之链接。由于推小果公司无法控制这些小程序及资源，<span class="u-font-bold">用户了解并同意，此类小程序或资源是否可供利用，推小果公司不予负责，存在或源于此类小程序或资源之任何内容、广告、产品或其它资料，推小果公司亦不予保证或负责。因使用或依赖任何此类小程序或资源发布的或经由此类小程序或资源获得的任何内容、商品或服务所产生的任何损害或损失，推小果公司不承担任何责任。</span></view>
      <u-gap height="10"></u-gap>
      

      <h2 class="u-font-bold">九、有限责任</h2>
      <u-gap height="10"></u-gap>

      <view>推小果公司对直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用产品服务，在网上购买商品或服务，在网上进行交易，非法使用服务或用户传送的信息有所变动。<span class="u-font-bold">用户的上述行为引起对推小果公司或第三方的损害，应当依法承担责任并向推小果公司进行赔偿，推小果公司可以自行或协助第三方使用用户提供的任何信息进行维权。</span></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十、未经推小果公司同意禁止进行商业性行为</h2>
      <u-gap height="10"></u-gap>

      <view>用户承诺不经推小果公司书面同意，不能利用推小果公司各项服务在推小果公司或相关小程序上进行销售或其他商业性宣传，否则将视情节轻重给予警告、封禁部分权限直至删除帐号的处罚；对于蓄意为某一商业机构进行多个商业宣传的，将视情节轻重予以警告、封禁部分权限直至删除帐号的处罚。<span class="u-font-bold">用户违反此约定，推小果公司将依法追究其违约责任，由此给推小果公司造成损失的，推小果公司有权进行追偿。</span></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十一、用户信息的储存及限制</h2>
      <u-gap height="10"></u-gap>

      <view>推小果公司不对用户所发布信息的删除或储存失败负责。推小果公司保留判定用户的行为是否符合推小果公司服务条款的要求和精神的权利，<span class="u-font-bold">如果用户违背了服务条款的规定，则推小果公司有权中断或删除其在小程序的帐号。</span></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十二、保障</h2>
      <u-gap height="10"></u-gap>

      <view>用户同意保障和维护推小果公司全体成员的利益，负责支付由用户违反本服务条款或为纠正用户的违反行为所引起的律师费用、诉讼费用、公正费用、鉴定费用、执行费用等，以及因违反服务条款的引起损害赔偿费用，其他人使用用户的电脑、帐号和其它知识产权的追索费。<span class="u-font-bold">如帐户被盗用，除非该事件由于推小果公司的过失导致，否则用户应承担被盗用期间产生的一切责任和后果。</span></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十三、结束服务</h2>
      <u-gap height="10"></u-gap>

      <view>用户同意推小果公司得基于其自行考虑，因任何理由，包含但不限于长时间未使用，或推小果公司认为用户已经违反本服务协议的文字及精神，终止用户的密码、帐号或本服务之使用（或服务之任何部分），并将用户在本服务内任何内容加以移除并删除。</view>
      <view>用户同意依本服务协议任何规定提供之本服务，无需进行事先通知即可中断或终止，用户承认并同意，百度可立即关闭或删除用户的帐号及用户帐号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。</view>
      <view>此外，<span class="u-font-bold">用户同意若本服务之使用被中断或终止或用户的帐号及相关信息和文件被关闭或删除，推小果公司对用户或任何第三人均不承担任何责任。</span></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十四、通告</h2>
      <u-gap height="10"></u-gap>

      <view>所有发给用户的通告都可通过电子邮件或常规的信件传送。推小果公司会通过邮件服务发报消息给用户，告诉他们服务条款的修改、服务变更、或其它重要事情。同时，推小果公司保留对推小果公司用户投放商业性广告的权利。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十五、参与广告策划</h2>
      <u-gap height="10"></u-gap>

      <view>在推小果公司书面许可下用户可在他们发表的信息中加入宣传资料或参与广告策划，在推小果公司各项免费服务上展示他们的产品。任何这类促销方法，包括运输货物、付款、服务、商业条件、担保及与广告有关的描述都只是在相应的用户和广告销售商之间发生。<span class="u-font-bold">推小果公司不承担任何责任，推小果公司没有义务为这类广告销售负任何一部分的责任。</span></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十六、知识产权</h2>
      <u-gap height="10"></u-gap>

      <view>用户保证和声明对其所提供的作品拥有完整的合法的著作权或完整的合法的授权可以用于其在推小果公司上从事的活动，保证推小果公司使用该作品不违反国家的法律法规，也不侵犯第三方的合法权益或承担任何义务。<span class="u-font-bold">用户应对其所提供作品因形式、内容及授权的不完善、不合法所造成的一切后果承担完全责任。</span></view>
      <view>用户同意推小果公司对其创作并上传的作品在全世界范围内享有免费的、永久性的、不可撤消的、独家的和完全的许可和再许可权利，以使用、复制、出版、发行、以原有或其他形式进行改编、转载、翻译、传播、表演和展示此等内容（整体或部分）。此许可和再许可权利包括但不限于此作品的著作权、邻接权及获得利益等权利。<span class="u-font-bold">用户同时承诺，不就上述作品以及上述作品的改编作品对任何第三方进行任何形式的许可使用。/或禁止继续使用前述文件或本服务。</span></view>
      <view>对于经用户本人创作并上传到推小果公司的文本、图片、图形、音频和/ 或视频等资料的商标和/或其它财产权利归属于推小果公司，<span class="u-font-bold">未经推小果公司同意，用户保证不以任何形式直接或间接发布、播放、出于播放或发布目的而改编或再发行，或者用于其他任何商业目的。同时保证不许可任何第三方从事上述行为。</span></view>
      <view>推小果公司保留对其小程序所有内容进行实时监控的权利，并有权依其独立判断对任何违反本协议约定的作品实施删除。<span class="u-font-bold">推小果公司对于删除用户作品引起的任何后果或导致用户的任何损失不负任何责任。</span></view>
      <view class="u-font-bold">因用户作品的违法或侵害第三人的合法权益而导致推小果公司或其关联公司对第三方承担任何性质的赔偿、补偿或罚款而遭受损失（直接的、间接的、偶然的、惩罚性的和继发的损失），用户对于推小果公司或其关联公司蒙受的上述损失承担全面的赔偿责任。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十七、言论</h2>
      <u-gap height="10"></u-gap>

      <view>用户承诺发表言论要：爱国、守法、自律、真实、文明。不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的，淫秽的、危害国家安全的、泄露国家机密的、破坏国家宗教政策和民族团结的以及其它违反法律法规及政策的内容，不得影射或攻击，不得含有不雅含义。</view>
      <view>若用户的行为不符合以上提到的服务条款，推小果公司将作出独立判断并立即取消用户服务帐号。用户需对自己在网上的行为承担法律责任。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十八、内容的所有权</h2>
      <u-gap height="10"></u-gap>

      <view>内容的定义包括：文字、软件、声音、相片、录象、图表；在广告中的全部内容；电子邮件的全部内容；推小果公司虚拟社区服务为用户提供的商业信息。所有这些内容均受版权、商标、标签和其它财产所有权法律的保护。所以，<span class="u-font-bold">用户只能在推小果公司和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。</span></view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">十九、免责与赔偿声明</h2>
      <u-gap height="10"></u-gap>

      <view>1、若推小果公司已经明示其网络服务提供方式发生变更并提醒用户应当注意事项，用户未按要求操作所产生的一切后果由用户自行承担。</view>
      <view>2、用户明确同意其使用推小果公司网络服务所存在的风险将完全由其自己承担；因其使用推小果公司服务而产生的一切后果也由其自己承担，推小果公司对用户不承担任何责任。</view>
      <view>3、推小果公司不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</view>
      <view class="u-font-bold">4、用户同意保障和维护推小果公司及其他用户的利益，由于用户登录小程序内容违法、不真实、不正当、侵犯第三方合法权益，或用户违反本协议项下的任何条款而给推小果公司或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</view>
      <view class="u-font-bold">5、本产品上的内容均为用户自行上传，我们不承担任何版权、知识产权等法律责任。如有侵权或侵犯到您的合法权益，请与我们联系，我们将在第一时间进行处理。</view>
      <view class="u-font-bold">6、如您发现本产品上有侵犯您合法权益的内容，请及时与我们联系，我们将在收到通知后尽快采取相应措施，包括但不限于删除、屏蔽等。请提供相关证明材料，以便我们进行核实</view>
      <view class="u-font-bold">7、若用户上传的内容涉及侵权行为，由上传用户承担相应的法律责任。我们作为平台方，将积极配合权利人进行维权，并依法采取必要措施。</view>
      <view class="u-font-bold">8、如您发现本产品上有侵犯您合法权益的内容，请及时与我们联系，我们将在收到通知后尽快采取相应措施，包括但不限于删除、屏蔽等。请提供相关证明材料，以便我们进行核实。</view>
      <view class="u-font-bold">9、我们对于用户上传的内容，仅提供存储和展示服务，不代表我们对内容的真实性、合法性、完整性负责。用户应自行判断并承担由此产生的法律风险。</view>
      <view class="u-font-bold">10、本产品不承担因用户上传内容而引发的任何直接、间接、特殊、附带或后果性的损失和责任。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">二十、法律</h2>
      <u-gap height="10"></u-gap>

      <view>用户和推小果公司一致同意有关本协议以及使用推小果公司的服务产生的争议交由仲裁解决，但是推小果公司有权选择采取诉讼方式，并有权选择受理该诉讼的有管辖权的法院。若有任何服务条款与法律相抵触，那这些条款将按尽可能接近的方法重新解析，而其它条款则保持对用户产生法律效力和影响。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">二十一、青少年用户特别提示</h2>
      <u-gap height="10"></u-gap>

      <view>1、青少年及使用推小果公司服务应该在父母和老师的指导下，正确学习使用网络。青少年避免沉迷虚拟的网络世界而影响日常的学习生活。</view>
      <view>2、青少年用户必须遵守全国青少年网络文明公约：</view>
      <view>要善于网上学习，不浏览不良信息；</view>
      <view>要诚实友好交流，不侮辱欺诈他人；</view>
      <view>要增强自护意识，不随意约会网友；</view>
      <view>要维护网络安全，不破坏网络秩序；</view>
      <view>要有益身心健康，不沉溺虚拟时空。</view>
      <u-gap height="10"></u-gap>


      <h2 class="u-font-bold">二十二、其他</h2>
      <u-gap height="10"></u-gap>

      <view>1、 推小果公司将视向用户所提供服务内容之特性，要求用户在注册推小果公司提供的有关服务时，遵守特定的条件和条款；如该特定条件和条款与以上服务条款有任何不一致之处，则已特定条件和条款为准。</view>
      <view>2、本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，其余条款仍应有效并且有约束力。</view>
      <view>3、本服务条款执行过程中所产生的任何问题本小程序和用户都将友好协商解决。</view>
      <view>4、以上条款的解释权归推小果公司最终所有。</view>
      <u-gap height="10"></u-gap>


      <view>请您在发现任何违反本服务协议以及其他任何单项服务的服务条款、推小果公司各类公告之情形时，通知推小果公司。您可以通过小程序在线客服和推小果公司取得直接联系。</view>
    </view>
  </view>
</template>

<style lang="scss" scoped>
.text-indent {
  text-indent: 2em;
}</style>
