const kocAdMapper = {
    1001: 7,   // 番茄小说
    1002: 3,   // QQ阅读
    1003: 1,   // 知乎
    1004: 8,   // 番茄畅听
    1005: 15,   // 今日头条
    1006: 5,   // 夸克
    1007: 6,   // UC故事会
    1008: 13,   // 起点
    1009: 11,  // 掌阅
    1010: 7, // 番茄漫画
    1011: 2, // 书旗小说
    1012: 2, // 书旗小说
    1013: 5, // 夸克漫画
    1014: 3, // QQ阅读
    1015: 11, // 掌阅漫画
    1016: 17, // 七猫
    1018: 19, // 红果短剧
}

const mountAdMapper = {
    1018: 57, // 红果短剧
  }

module.exports = {
    kocAdMapper,
    mountAdMapper
}