// 视频类型
export const VIDEO_TYPE_MAPPER = {
  6: '短视频任务',
  55: '直播任务',
};

// 星图结算--推广--结算方式
export const PAY_TYPE_MAPPER = {
  1: '视频按等级发奖（按等级结算）',
  2: '自定义（自定义结算）',
  3: '按激活付费（按转化结算）',
  4: '按效果付费（按有效播放量结算）',
  5: '按cps付费（按销售量结算）',
  8: '按广告分成结算（按广告分成结算）',
  9: '按核销量付费（按核销量结算）',
  10: '暗投CPA（按转化结算）',
  11: '新版按广告分成结算（按广告分成结算）',
  12: '一口价招募模式（按一口价结算）',
  13: '根据业务方分成（自定义结算）',
  14: '按分成付费（按付费分佣结算）',
  15: '交换作品（达人作品和客户的物品）、好物测评',
  16: 'ocpm付费',
};

// 星图结算--财务--同步--结算方式
export const SYNC_SETTLEMENT_MAPPER = {
  3: '按转化结算',
  14: '按付费分佣结算',
}

// 考核指标
export const EVALUATE_TYPE_MAPPER = {
  1: '视频播放量',
  2: '视频转赞评总量',
  3: '视频效果',
  4: '视频转化量',
  5: '视频有效播放量',
  6: '线索数量',
  7: '销售量',
  8: '组件点击',
  9: '组件展示',
  10: '下载数量',
  11: '有效线索数量',
  12: '有效销售额',
  13: '广告分成',
  14: '团购券核销量',
  15: '广告分成',
  16: '一口价招募模式',
  31: '引流到站-组件点击',
  32: '引流到站-APP唤起',
  33: '注册量',
  34: '首单转化量',
  35: '预约量',
  36: '付费量',
  121: '按分成付费-游戏cps',
  131: '小程序直播推广计划',
  132: '按安装付费-游戏发行人',
  133: '按激活付费-游戏发行人',
  134: '按播放量付费-游戏发行人',
  135: '按播放量付费-游戏发行人v2',
  136: '按安装付费-游戏发行人v2',
  137: '按激活付费-游戏发行人v2',
  138: '按预约付费-游戏发行人v2',
  140: '按安装付费-授权挂载',
  141: '按激活付费-授权挂载',
  142: '按线索付费-授权挂载',
  201: '客户自定义',
  150: '按播放量付费-好物测评',
  151: '组件点击量-好物测评',
  152: '自然播放量',
  153: '自然流量的激活',
};

// 一级行业
export const FIRST_CLASS_CATEGORY = {
  1901: '3C及电器',
  1902: '快速消费品',
  1903: '食品饮料',
  1904: '服装配饰',
  1905: '医疗健康',
  1906: '商务服务',
  1907: '本地服务',
  1908: '房地产',
  1909: '家居建材',
  1910: '教育',
  1911: '出行旅游',
  1912: '社会公共',
  1913: '游戏',
  1914: '零售',
  1915: '交通工具',
  1916: '汽车',
  1917: '农林牧畜渔',
  1918: '化工及能源',
  1919: '电子电工',
  1920: '机械设备',
  1921: '文体娱乐',
  1922: '传媒资讯',
  1923: '物流业',
  1924: '通信',
  1925: '金融业',
  1927: '餐饮服务',
  1928: '工具类软件',
  1929: '招商加盟',
  1930: '美妆',
  1931: '母婴宠物',
  1933: '日化',
  1934: '实体书籍',
  1935: '社交通讯',
};

// 二级行业
export const SECOND_CLASS_CATEGORY = {
  190301: '零食/坚果/特产',
  190309: '其他食品饮料',
  190602: '传媒服务商',
  190701: '生活服务综合平台',
  190715: '结婚服务',
  190917: '家装平台',
  191103: 'OTA（online travel Agent）',
  191301: '休闲游戏',
  191302: '棋牌桌游',
  191303: '角色扮演',
  191305: '体育竞技',
  191308: 'MOBA',
  191309: '其他游戏',
  191310: '射击游戏',
  191311: '动作游戏',
  191312: 'SLG',
  191313: '塔防游戏',
  191314: '模拟经营',
  191315: '卡牌游戏',
  191317: '游戏平台',
  191401: '综合类2B电商',
  191403: '综合类2C电商',
  191601: '汽车厂商',
  191606: '汽车综合服务平台',
  192114: '其他文体娱乐',
  192203: '影视综艺音像制作',
  192204: '数字版权',
  192208: '网络视听',
  192209: '其他传媒资讯',
  192211: '资讯',
  192401: '电信运营商',
  192501: '银行业',
  192801: '软件工具',
  192804: '实用工具',
  192805: '其他工具类软件',
  193502: '交友类社交通讯',
};

// 任务类型
export const XINGTUTASK_TYPE_MAPPER = {
  6: '短视频任务',
  55: '直播任务',
}

// MCN分佣状态
export const MCN_PROFIT_MAPPER = {
  'UNPROFIT': '未分佣',
  'PROFITED': '已分佣',
}

// 任务状态
export const DEMEND_STATUS_MAPPER = {
  1: '开启',
  3: '归档',
}

// 组件类型
export const ITEM_COMPONENT_TYPE = {
  1: '落地页',
  2: '门店',
  3: '电商',
  4: '游戏站',
  5: '影视',
  6: '小程序/小游戏',
  9: '汽车行业锚点',
  10: '电商行业锚点',
  12: '保险行业锚点',
  13: '教育行业锚点',
  14: '家装行业锚点',
  15: '网服下载锚点',
  23: '招商行业锚点',
  26: '游戏行业锚点',
  27: '通信行业锚点',
  40: '直播小程序组件',
  41: '商城锚点',
  42: '店铺锚点',
  43: '直播小手柄组件',
  46: '短剧/合集组件',
  48: '高级在线预约组件',
  49: '在线咨询组件',
  56: '直播小游戏',
}

// 审核状态
export const AUDIT_STATUS_MAPPER = {
  1: '未提交',
  2: '审核中',
  3: '审核通过',
  4: '审核拒绝',
}

// 结算状态
export const SETTLEMENT_STATUS_MAPPER = {
  1: '待结算',
  2: '结算中',
  3: '已结算',
}

// 任务订单状态
export const TASK_ORDER_STATUS_MAPPER = {
  1: '投稿中',
  10: '已关闭',
  11: '已取消',
  2: '选稿中',
  3: '公示中',
  4: '已结束',
  5: '计费中',
  6: '预热中',
  7: '视频交付中',
  20: '服务商接单中',
}